{"pageProps":{"articleData":{"id":27,"attributes":{"title":"2 Million $MRHB for Liquidity Providers on Pancakeswap Pool!","date":"2022-04-06","content":"[MRHB DeFi](https://mrhb.network/), the world’s first halal and ethical decentralized finance (DeFi) platform, launched their $MRHB token on the popular PancakeSwap DEX in December 2021. To promote the listing, the company set aside a pool of 5 million MRHB tokens to reward liquidity providers (LPs) with through to the end of March. **MRHB has now decided to extend the LP reward period until June 30, and is adding an additional 2 million MRHB tokens to the reward pool.**\n\nFor anyone unaware of this opportunity, the details are as follows: LPs must supply liquidity to the [USDT/MRHB liquidity pool](https://pancakeswap.finance/info/pool/0xa32bbaa2a8df16f347250df0f77808bd9a8aa77c) on PancakeSwap to qualify for rewards. A total of 2 million MRHB tokens will be divided between all participating LPs over a three-month period. This reward is provided by MRHB DeFi as a third party offering a conditional gift (‘hibah muallaqah bi al-sharth’), which is permissible according to Islamic Fiqh.\n\nBy providing liquidity on PancakeSwap, you can help us spread our service throughout the world to realize our mission of bringing ethical finance to all people. After years of non-regulation and uncertainty about crypto, it is time to carve out a safe space in the cryptoverse where ethics-conscious people can manage their finances with peace of mind.\n\n**Additional Information for LPs**\n\nProviding liquidity on a DEX is not without risk. All prospective LPs must first understand about a concept known as ‘impermanent loss’. If you are unfamiliar with the term, please refer to [this article](https://academy.binance.com/en/articles/impermanent-loss-explained) to get a firm understanding of the risks involved.\n\nWe also have a couple of videos that will be useful for LPs:\n\n*   How to Buy/Swap MRHB Tokens Using Metamask Wallet: [https://www.youtube.com/watch?v=A-LqaeY9Ttw](https://www.youtube.com/watch?v=A-LqaeY9Ttw)\n*   How to Make Passive Income by Providing Liquidity on Pancakeswap: [https://www.youtube.com/watch?v=jebBMzes0HY](https://www.youtube.com/watch?v=jebBMzes0HY)\n\nAlternatively, check out our blog post for the [step-by-step slideshow](https://medium.com/how-mrhb-token-holders-can-earn-passive-income-from-trading-fees-and-5-million-pool-of-mrhb-6848152d51c7) walkthrough on how to add liquidity on Pancakeswap: [https://mrhbdefi.medium.com/how-mrhb-token-holders-can-earn-passive-income-from-trading-fees-and-5-million-pool-of-mrhb-6848152d51c7](https://medium.com/how-mrhb-token-holders-can-earn-passive-income-from-trading-fees-and-5-million-pool-of-mrhb-6848152d51c7)\n\nLastly, we cannot stress enough the importance of staying vigilant on the internet — scammers abound. Never give your wallet password out to anyone. When sending funds to a liquidity pool, you must only do so on the exchange itself — do not send to addresses given to you by strangers. MRHB DeFi will never ask you for funds. The only links and information that can be trusted are those we share on our official channels below.\n\nAs always, we wholeheartedly appreciate the tremendous support our community and investors have shown.\n\nThank you for sticking with us in our journey to bring halal DeFi to the masses!\n\n**MRHB DeFi Official Channels**\n\n[Website](https://mrhb.network/)| [MRHB Reward Dashboard](https://rewards.mrhb.network/) | [Twitter](https://twitter.com/marhabadefi) | [Telegram Chat](https://t.me/mdf_official) | [Telegram Announcements](https://t.me/marhabadefi_ANN) | [Medium](https://medium.com/@mrhbdefi) | [Documents](https://marhabadefi.com/info-centre.php) | [Facebook](https://www.facebook.com/MRHB-DeFi-105893235209147/) | [LinkedIn](https://www.linkedin.com/company/marhabadefi/) | [Telegram Arabic Community](https://t.me/mdf_arabic) | [Russian Community](https://t.me/mdf_russia) | [Turkish Community](https://t.me/MarhabaDefiTR) |[Persian Community](https://t.me/mrhbdefi_persian) | [Urdu/Hindi Community](https://t.me/MRHBDeFi_Urdu_Hindi)","createdAt":"2022-11-15T20:44:13.444Z","updatedAt":"2023-01-03T04:21:55.428Z","publishedAt":"2022-11-15T20:44:13.438Z","locale":"en","Url":"2-million-mrhb-for-liquidity-providers-on-pancakeswap-pool","meta":"A pool of 5 million MRHB tokens has been set aside to reward liquidity providers on the popular PancakeSwap DEX.","cover":{"data":{"id":108,"attributes":{"name":"2 Million $MRHB for Liquidity Providers on Pancakeswap Pool! cover.jpg","alternativeText":null,"caption":null,"width":1440,"height":810,"formats":null,"hash":"2_Million_MRHB_for_Liquidity_Providers_on_Pancakeswap_Pool_cover_ad84ff5eb5","ext":".jpg","mime":"image/jpeg","size":24005.06,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/2_Million_MRHB_for_Liquidity_Providers_on_Pancakeswap_Pool_cover_ad84ff5eb5.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:40:37.425Z","updatedAt":"2022-12-28T12:40:37.425Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}