{"pageProps":{"articleData":{"id":54,"attributes":{"title":"AMA Series: Crypto Library x Marhaba DeFi","date":"2021-08-28","content":"[![MRHB DeFi](https://miro.medium.com/fit/c/96/96/1*yYNvCL8jpnMWXc0bkUJOcA.png)\n\n](https://medium.com/?source=post_page-----a0e8b91cf2bf--------------------------------)[MRHB DeFi](https://medium.com/?source=post_page-----a0e8b91cf2bf--------------------------------)Follow\n\nAug 29, 2021\n\n·8 min read\n\nAMA Series: Crypto Library x Marhaba DeFi\n=========================================\n\nFollowing is the encapsulated recap of AMA with [Crypto Library](https://twitter.com/CryptoLibrarys). [Dr. Ahmed Jawa（Head of Marketing Strategy and Operations)](https://linkedin.com/in/ahmedjawa/) addressed the community about Marhaba’s progress and plans.\n\n**Date :** 21st August 2021, Saturday\n\n**Time :** 11:00 AM UTC\n\n**Venue :** [Crypto Library](https://t.me/CryptoLibraryDiscussion)\n\n**Reward Pool :** 100$\n\n**Speaker :** [Dr. Ahmed Jawa（Head of Marketing Strategy and Operations)](https://linkedin.com/in/ahmedjawa/)\n\nAMA Transcript\n==============\n\n\\* Introduction Segment \\*\n==========================\n\n**Q1. So, before we start the AMA could you please introduce yourself to our community?**\n\n**Response:** My name is Ahmed, I have been working with MarhabaDeFi for some time focused on Marketing, Strategy and Operations. I come from a Finance background and have been working in various Corporate and IGO roles in the past. Having a strong passion for Faith-Based investing brought me to MarhabaDeFi. On the side I also run a Faith-Based Finance Youtube Channel.\n\n**Q2. What is MarhabaDeFi? and how is the story behind the MarhabaDeFi project creation?**\n\n**Response:** Marhaba DeFi is a platform built to embody the true spirit of an “Inclusive DeFi” by promoting participation finance, where all communities, including the ones from the Islamic World, can benefit from the benefits of DeFi. Based on the tenets of Blockchain such as trust, transparency, and security; Marhaba DeFi has encapsulated universally applicable principles of Shariah into those tenets of Blockchain to render a suite of offerings. Well, Marhaba was incubated when we were researching DeFi protocols. We discovered most of them are strictly non shariah compliant. Hence Marhaba was born to bring shariah based DeFi solutions, to include the Muslim community AS WELL into the defi ecosystem.\n\n**Q3. What features and products does MarhabaDeFi want to offer? And why should we choose MarhabaDeFi?**\n\n**Response:** Marhaba is more than a single product. Its an entire ecosystem that has a range of DeFi products. Some building on existing DeFi “lego blocks” and others completely innovational. We are striving to allow individuals who are keen and interested in DeFi to earn, sell, borrow and yield on DeFi products hence the suite of applications. Our goal is to create an ecosystem where our Sahal Wallet will serve as the gateway and $MHB as the token behind it to power and govern the ecosystem. And all of these solutions are accredited Shariah compliant. We will be releasing a full scale whitepaper to follow on all our products which will detail how things will work under the hood and explain product line extensively. For now you can visite our website for more information → [https://marhabadefi.com/](https://marhabadefi.com/). Invest in MHB because its focused on providing an all encompassing crypto solution that is focusing on a huge gap of the market.\n\n**Q4. Please tell us about $MHB token! What are the token use-case, distribution, and where we can buy it?**\n\n**Response:** $MHB Token is what will be used to manage all the ecosystem services, the token will as mentioned serve as the backbone of the ecosystem and will be put forward in all our products as a way to pay fees, offset fees, earn rewards, stake for perks and more. Some other information: total supply will be 1b which has changed from our initial total supply upon more members joining and more brain power contributing to reasons behind it. Now if you want to know where it is being developed, such as polygon… Eth… or BSC. THEN JOIN OUR TELEGRAM CHAT!\n\n**Q5. Could you give us some information about your roadmap, your milestones, and also your future plans?**\n\n**Response:** Yea for sure! this is what excited me a lot also. Interest free Liquidity lending:\n\n\\- Sahal Wallet:\n\nA non custodial wallet, that has a trusted framework of a “filter” layer that allows only sharia screened tokens and NFTs to be stored, transacted, and managed by the user.\n\n\\- Ethical Trading Platform:\n\nA decentralized Crypto Trading, a Sharia compliant Liquidity Farming and Staking — all at one place.\n\n\\- Yield Maximizer Buckets:\n\nThe Marhaba investment buckets symbolize different strategic approaches adopted by the Marhaba platform to invest in the DeFi space.\n\nAnd many more! At Marhaba we have an extensive plan in regards to our roadmap which is a very enticing solution for the global faith-based investors and also general investors. You can read more about the solutions on our website ([https://marhabadefi.com/#about](https://marhabadefi.com/#about)). Most of these solutions and services will be linked to MHB token- thus directly or indirectly driving demand for the token. Soon we will be releasing our whitepaper → stay excited and follow us on our Social Media to get the fasted updates\n\n\\* Twitter Segment ️\\*\n======================\n\n**Q1. Can you explain about the Marhaba NFT Market place called Souq NFT? what makes it unique from other Marketplaces? Can we freely buy/sell/trade NFT from different chains? And what do you mean about “no code” platform for enabling NFT creation?**\n\n**Response:** Yes, it is true we are developing an NFT Marketplace as one of our products. This willl initially run on BSC but have some exciting and innovative ideas to make this marketplace stand out in the crowd. Users will be able to mint, sell, and buy NFTs of course and $MHB will play a key role. What makes this unique is that this will have all Sharia compliant NFTs and that it will promote a nich market to get into the NFT world. I do not want to give away too much but exciting products on our roadmap this being just one. If i missed anything do join our telegram and ask there as our tech lead would be able to answer the question for you! Telegram → [https://t.me/mdf\\_official](https://t.me/mdf_official)\n\n**Q2. Marhaba was born to provide Sharia-based DeFi solutions to include the Muslim community in the whole DeFi ecosystem. But, could you explain how you achieved such a fusion? What strategies did you use to bring “sharia” concepts to the “general” DeFi world?**\n\n**Response:** Financial exclusion is one of the major problems in the world. Many researches have found that financial inclusion can contribute in eliminating poverty. Marhaba Defi is focusing on financial inclusion. Shariah compliance is the main ingredient of $MHB token and Marhaba platform that aims to bring ethical and social values to the defi world. To put it into context, we have an internal Sharia team (Sharia Experts) that of very accredited Sharia scholars from the field of Islamic Finance. Not only do we have an internal team, we will also get an external team to audit our products and services. The scholars at Marhaba looked at the products that are being offered in a DeFi ecosystem, and how these products are traded. What ever we think is acceptable from an Islamic perspective, we will keep and what ever we think is not acceptable, we will reject it. So for Marhaba, we will allow only those existing tokens that we feel are shariah compliant to be traded on the platform. For example, we will not allow token created for gambling purposes etc. Similarly, the methods of trading that are unislamic, we will adapt them to make them shariah compliant. For example, conventional forward trading is not shariah compliant, but with few changes to its structure, we could make it Islamic.\n\n**\\* Live Segment ️\\***\n=======================\n\n**Q1. What are Islamic principles in Marhaba defi that users need to know (especially the Sharia law). Is it an all Islamic project or will non islams be welcomed? Regarding an artist been able to upload art work to your nft platform, will the work be reviewed by the development team to ensure that it follow the rules of Sharia?**\n\n**Response:** From a user perspective, you would not need to know any Sharia principles, as this is somthing our experts will do for you. They will do all the hardwork and you all can enjoy from their research and efforts. This project is an inclusive project for all, the ecosystem is built to be inclusive towards the muslim community also, as many of the crypto projects have a few conflicting things with sharia. We have many investors, partners and enthusiasts that are not muslims! We are currently working on the guide of the NFT, this is a good question so i would forward this to the tech and sharia team forsure!\n\n**Q2. All DeFi and cryptographic projects provide support to the communities around the project, so can you explain how Marhaba supports and helps its entire community? Do you provide multilingual support for the whole international community?**\n\n**Response:** For sure!!!! we have multilingual teammates, Telegram groups, writers, we will do our best to accommodate everyone.\n\n**Q3. What is your motive behind creating this project? And is there event or airdrops in your project to get people Attention?**\n\n**Response:** The founder’s and everyone in this project have one motive — inclusivity. This project was made to help all the faithbased investors, traders and users who needed a project that solves their crypto financial needs without marginalizing the religious needs. Yes we have an entire long term marketing plan with various methods.\n\n**Q4. Do you have Whitepaper if yes please share it with us and secondly do you have plans for pre-sale? Where can we join it?**\n\n**Response:** We currently have a litepaper on our website and the Whitepaper is almost complete! we will be sharing that with you soon! to get to kmow about this first, follow us on our social Media.\n\n**Q5. We investors think about how to win Quickly. What will be your Advantages for holding your Token in the long run?**\n\n**Response:** As our project has a huge vission and mission behind it, we are not a pump and dump, our team is a ver accredited team that is focused on longevity success and the growth of our users. Thus we have put together a very strong reputable tokonomics. Soon the detailed tokonomics and vesting will be released and you can read exactly what i am talking about.\n\n\\* End of AMA Transcript \\*\n===========================\n\n**About MRHB DeFi**\n===================\n\nMRHB DeFi is a platform built to embody the true spirit of an “Inclusive DeFi” by promoting participation finance, where all communities, including the ones from the Islamic World, can benefit from the benefits of DeFi.\n\nBased on the tenets of Blockchain such as trust, transparency, and security; MRHB DeFi has encapsulated universally applicable principles of Shariah into those tenets of Blockchain to render a suite of offerings.\n\nMRHB DeFi was founded with the vision of bringing a “Muslim also” platform, rather than making it an exclusive “Muslim only” offering.\n\nWe are a diverse team of researchers, technocrats, influencers, islamic fintech experts & business entrepreneurs, who came together to ensure that MRHB DeFi prevails in a manner that will impact society as a whole, essentially bridging the gap between the Faith-Conscious Communities and the Blockchain world.\n\n**Read more about MRHB DeFi here:**\n\n[Website](http://mrhb.finance/) | [Twitter](https://twitter.com/marhabadefi) | [Telegram Chat](https://t.me/mdf_official) | [Telegram Announcements](https://t.me/marhabadefi_ANN) | [Medium](https://medium.com/@marhabadefi) | [Documents](https://marhabadefi.com/info-centre.php) | [Facebook](https://facebook.com/marhabadefi) | [LinkedIn](https://www.linkedin.com/company/marhabadefi/) | [Telegram Arabic Community](https://t.me/mdf_arabic)","createdAt":"2022-11-15T20:51:28.382Z","updatedAt":"2022-11-15T20:51:28.382Z","publishedAt":"2022-11-15T20:51:28.378Z","locale":"en","Url":"ama-series-crypto-library-x-marhaba-defi","meta":"","cover":{"data":{"id":149,"attributes":{"name":"AMA Series: Crypto Library x Marhaba DeFi cover.jpg","alternativeText":null,"caption":null,"width":700,"height":400,"formats":{"small":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/small_AMA_Series_Crypto_Library_x_Marhaba_De_Fi_cover_064153daea.jpg","hash":"small_AMA_Series_Crypto_Library_x_Marhaba_De_Fi_cover_064153daea","mime":"image/jpeg","name":"small_AMA Series: Crypto Library x Marhaba DeFi cover.jpg","path":null,"size":11.13,"width":500,"height":286},"thumbnail":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/thumbnail_AMA_Series_Crypto_Library_x_Marhaba_De_Fi_cover_064153daea.jpg","hash":"thumbnail_AMA_Series_Crypto_Library_x_Marhaba_De_Fi_cover_064153daea","mime":"image/jpeg","name":"thumbnail_AMA Series: Crypto Library x Marhaba DeFi cover.jpg","path":null,"size":4.61,"width":245,"height":140}},"hash":"AMA_Series_Crypto_Library_x_Marhaba_De_Fi_cover_064153daea","ext":".jpg","mime":"image/jpeg","size":13.21,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/AMA_Series_Crypto_Library_x_Marhaba_De_Fi_cover_064153daea.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:53:32.387Z","updatedAt":"2022-12-28T12:53:32.387Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}