{"pageProps":{"articleData":{"id":29,"attributes":{"title":"Can Blockchain help the United Nations’ SDGs make Social Impact?","date":"2022-04-04","content":"[![MRHB DeFi](https://miro.medium.com/fit/c/96/96/1*yYNvCL8jpnMWXc0bkUJOcA.png)\n\n](https://medium.com/?source=post_page-----efec179268d1--------------------------------)[MRHB DeFi](https://medium.com/?source=post_page-----efec179268d1--------------------------------)Follow\n\nApr 5\n\n·4 min read\n\nCan Blockchain help the United Nations’ SDGs make Social Impact?\n================================================================\n\nFrom a knobbly beginning in 1993, the internet evolved and morphed into technology that changed modern life. Bitcoin and, therefore, blockchain slipped into existence with relatively little fanfare. Blockchain technology is now one of the watchwords of the 2020s, alongside cryptocurrencies, and the chatter has reached a crescendo today. So what’s behind the hype?\n\nIn its simplest form, the blockchain is an enormous database. It is a decentralized, peer-to-peer (P2P) network, which means no one person or entity controls it. All users help manage information flow, and once new data has been added to the blockchain, no one can alter it.\n\nMost people connect blockchain with cryptocurrencies such as Bitcoin or Ethereum, but the technology has a broader scope of uses.\n\nThe characteristics of immutability, simultaneity, and decentralization make blockchain an instrument to reduce costs, reduce waste, and increase transparency in various contexts regarding sustainability.\n\nThe word “sustainable” refers to a process or its outputs that are economically viable, socially inclusive, and environmentally friendly.\n\nAn economically possible process is financially self-supporting. A socially inclusive process is open to all people and groups in a community, and an ecologically friendly approach at its minimum ensures there is no harm to the surrounding ecology. All three characteristics must be met for sustainability.\n\nThe United Nations has also articulated some [sustainable development goals](https://sdgs.un.org/goals) or SDGs to make these ideas concrete.\n\nMapping Blockchain To SDGs\n==========================\n\nSDGs are 17 goals backed by 193 countries, built upon the success of the [Millennium Development Goals](https://www.who.int/news-room/fact-sheets/detail/millennium-development-goals-(mdgs)#:~:text=The%20United%20Nations%20Millennium%20Development%20Goals%20%28MDGs%29%20are,disease%2C%20illiteracy%2C%20environmental%20degradation%2C%20and%20discrimination%20against%20women) and complete what these did not achieve.\n\nBlockchain technology and digital identity (DID) can accelerate and advance their impact towards a universal call to action to end poverty, fight inequalities and injustice, and tackle climate change.\n\nEconomists at the World Economic Forum [predicted](https://www3.weforum.org/docs/WEF_GAC15_Technological_Tipping_Points_report_2015.pdf) that by 2027, 10% of the global gross domestic product would be stored in one form or another in blockchain technology.\n\nLet’s look at how blockchain is already helping reduce costs, realigning the idea of borders, and disrupting the world as we know it.\n\nCan Blockchain Help with Sustainability?\n========================================\n\nThe use of blockchain offers far-reaching possibilities for social impact, including:\n\n*   Transparency\n*   Supply chain management\n*   Digital identity\n*   Personal data protection\n*   Legitimacy\n*   Compliance\n*   Trust\n\nAlthough it is not a perfect solution, it can help us develop our world more sustainably. As many people say, blockchain is the missing piece of the internet. While still very immature, industries in the DeFi segment are playing a part in upholding and aligning themselves with the SDGs.\n\n[MRHB DeFi](https://medium.com/mrhb-defi-signs-crypto-climate-accord-cca-to-support-green-crypto-205a9db8e013) is one such prominent platform in the Islamic DeFi world that supports the United Nations Sustainable Development Goals, having [signed](https://medium.com/mrhb-defi-signs-crypto-climate-accord-cca-to-support-green-crypto-205a9db8e013) the Crypto Climate Accord to support green crypto.\n\nLet’s look at some case studies and the potentially far-reaching implications of blockchain.\n\nSocial Impact Of Blockchain On Society\n======================================\n\nMany private enterprises, governments, and non-governmental organizations (NGOs) use blockchain to effect social impact. Let’s look at some case studies and the potentially far-reaching implications of blockchain.\n\nThere is much discourse about public and private bodies announcing what they will do, but it’s hard to prove if what they announce happens.\n\nTelling is one thing, but showing is another. In a globalized, digitized world, accountability is a slippery eel, be it applied to government, charity, or business. Public transparency is high on the agenda in the war against misinformation.\n\nEarlier this year, Ethereum co-founder Vitalik Buterin [donated](https://edition.cnn.com/2021/05/13/business/ethereum-shiba-inu-india-covid-donation/index.html) $1 billion of cryptocurrency to support India’s Covid-Crypto Relief Fund. We know because his public, blockchain-backed digital wallet showed the transaction. Imagine holding governments to spending pledges and tracking charity’s disaster relief and aid distribution work.\n\nBlockchain can make a significant impact on the [supply chain](https://www.forbes.com/sites/forbestechcouncil/2021/11/08/blockchain-in-supply-chain/?sh=5ae6daad4e1a). The supply chain industry is fragmented — with many parties operating in silos.\n\nBlockchain presents a technology promise that would have far-reaching implications for global trade and supply chains — bringing standardization, alignment, and transparency. For example, [Agridigital](https://www.agridigital.io/) is streamlining grain supply chains between farmers and markets, incorporating real-time information on delivery and payments.\n\nA recent [report](https://www.theguardian.com/environment/2021/mar/15/revealed-seafood-happening-on-a-vast-global-scale) found that 40% of fish bought in restaurants, markets, and from fishmongers worldwide were mislabeled and, in some cases, contained traces of pig. This happened because there was no transparent supply chain. Imagine if blockchain tracked boats, catches, markets, and deliveries!\n\nDoes Blockchain Technology Help The Environment?\n================================================\n\nUnsurprisingly, given the callow nature of the technology, blockchain is not a technological panacea yet. But it does have the potential to revolutionize our relationship with energy. Many miners use lots of renewable energy, such as wind power surpluses or hydropower, that may otherwise be lost. Estimates of Bitcoin energy mining range from [39%](https://www.jbs.cam.ac.uk/faculty-research/centres/alternative-finance/publications/3rd-global-cryptoasset-benchmarking-study/) to [74%](https://coinshares.com/assets/resources/Research/bitcoin-mining-network-june-2019-fidelity-foreword.pdf), renewably- sourced. There are signs that more miners and investors are increasingly aware of the environmental cost of Bitcoin; for example, Terrapass offers [carbon offsetting plans](https://terrapass.com/blog/carbon-offsets-bitcoin-mining) for Bitcoin mining.\n\nRipple, a [cryptocurrenc](https://ripple.com/ripple-press/ripple-leads-sustainability-agenda-to-achieve-carbon-neutrality-by-2030/)y, has signed up to be 100% powered by renewable energy by 2030. Cryptocurrency Candela insists all its mining is solar-powered. They plan to encourage people to sell their homes’ excess solar power to neighbors. [Plastic Bank](https://plasticbank.com/about/) allows people to track plastic as it moves from recycling to being repurposed as banknotes.\n\nIn addition, besides holding governments and businesses to green pledges, when business infrastructure is built on blockchain, such as supply chains, the transparency aspect also ensures that greenwashing becomes a thing of the past.","createdAt":"2022-11-15T20:47:38.884Z","updatedAt":"2022-11-15T20:47:38.884Z","publishedAt":"2022-11-15T20:47:38.879Z","locale":"en","Url":"can-blockchain-help-the-united-nations-sdgs-make-social-impact","meta":"","cover":{"data":{"id":111,"attributes":{"name":"Can Blockchain help the United Nations’ SDGs make Social Impact? cover.jpg","alternativeText":null,"caption":null,"width":1280,"height":720,"formats":{"large":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/large_Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677.jpg","hash":"large_Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677","mime":"image/jpeg","name":"large_Can Blockchain help the United Nations’ SDGs make Social Impact? cover.jpg","path":null,"size":33.56,"width":1000,"height":562},"small":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/small_Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677.jpg","hash":"small_Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677","mime":"image/jpeg","name":"small_Can Blockchain help the United Nations’ SDGs make Social Impact? cover.jpg","path":null,"size":14.13,"width":500,"height":281},"medium":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/medium_Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677.jpg","hash":"medium_Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677","mime":"image/jpeg","name":"medium_Can Blockchain help the United Nations’ SDGs make Social Impact? cover.jpg","path":null,"size":23.84,"width":750,"height":422},"thumbnail":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/thumbnail_Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677.jpg","hash":"thumbnail_Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677","mime":"image/jpeg","name":"thumbnail_Can Blockchain help the United Nations’ SDGs make Social Impact? cover.jpg","path":null,"size":5.11,"width":245,"height":138}},"hash":"Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677","ext":".jpg","mime":"image/jpeg","size":40.13,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/Can_Blockchain_help_the_United_Nations_SD_Gs_make_Social_Impact_cover_042e85c677.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:42:17.491Z","updatedAt":"2022-12-28T12:42:17.491Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}