{"pageProps":{"articleData":{"id":52,"attributes":{"title":"Coinsbit India & Marhaba Partner to Bring Shariah-Compliant Crypto to India’s 200 Million Muslims","date":"2021-08-30","content":"\n\nLeading Indian cryptocurrency trading platform Coinsbit is collaborating with Shariah-complaint DeFi project Marhaba to bring the opportunities offered by crypto to India’s huge population of 200 million Muslims, driving wider adoption in digital assets.\n\nMarhaba’s vision of inclusive DeFi, is intended for use by Muslims as well as anyone looking for a socially conscious blockchain platform.\n\nBeing Shariah-compliant means that Marhaba operates within the highly ethical constraints of Shariah law, encourages moral global practices and stands strongly against manipulation.\n\n**Partnership Vision**\n\nIndia is home to 200 million Muslims constituting 10% of the world’s Muslim population. It is the world’s third-largest and the world’s largest Muslim-minority population.\n\nMarhaba, a Shariah Law compliant platform, has entered into strategic partnership with Coinsbit India, bringing a win-win situation for both, in the following ways:\n\n*   _Coinsbit would be the first exchange to introduce a certified Shariah compliant project to the Muslim Community and gain edge over other Indian exchanges. Marhaba will do an IEO in the Coinsbit Exchange during launch and introduce $MHB (Marhaba Token) to the global community_\n*   _Coinsbit is headquartered in Hyderabad and has geographical advantage as Hyderabad & Bangalore, a nearby metropolitan, has a big community of Muslims_\n*   _Marhaba will integrate Coinsbit’s portal with its app (Sahal Wallet), enabling users to directly use Coinsbit for trading_\n*   _Coinsbit will give the users a trading platform, where $MHB (Marhaba Token) would be available to the Indian Community_\n*   _Marhaba DeFi would also lead marketing activities for the exchange in the Australian market_\n*   _Both the partners will gain from each other’s marketing and community growth activities_\n\nAsian countries are outpacing the rest of the world in terms of cryptocurrency adoption and India has ranked second in the global cryptocurrency adoption index, according to the 2021 Global Crypto Adoption Index by blockchain data platform Chainalysis. Indians have invested 5X the amount of the previous year and the momentum is encouraging.\n\nCrypto adoption is on the rise in India and the Indian exchanges WazirX, CoinDCX and Coinswitch Kuber doubled their user base between January and March 2021.\n\nCoinsbit India started its operations recently and has already captured market attention by onboarding a million users in around three months.\n\n_“We’re excited about embarking on this shared journey with MRHB. Islamic DeFi and Shariah-based crypto financial products are an area of extraordinary growth and potential for India. We’re committed to delivering MRHB DeFi’s visionary range of services and products to our clients across our continent,” —_ [_Ravneet Kaur_](https://twitter.com/ravneetkaurtech)_, CEO of Coinsbit India._\n\n_“Blockchain and DeFi have exploded in popularity in 2021, and we forecast this stratospheric growth to continue. That’s why we’re excited to be teaming up with one of India’s premier cryptocurrency exchanges to offer MRHB DeFi products and services to everyone across the Indian subcontinent who are looking for a true, ethical alternative to the existing platforms in the cryptoverse,” —_ [_Naquib Mohammed_](https://twitter.com/odiatokkanaquib)_, Marhaba DeFi Founder & CEO._\n\n**About Coinsbit India**\n\nSince its inception in 2017, Coinsbit has been one of the most trusted exchange platforms for cryptocurrency traders from around the world. Coinsbit India aims to become the leading trading platform for the Indian market, which is just beginning to realize the potential of cryptocurrency. It always works according to the guidelines set by the government of India. Coinsbit India is committed to providing a service, reliability and convenience that cannot be matched by any other platform, and being one of the world’s largest cryptocurrency exchanges, are proud to represent India.\n\n**Read more about Coinsbit India here:**\n\n[Website](https://coinsbit.in/) | [Telegram](https://t.me/CoinsbitIndiaChannel) | [Twitter](https://twitter.com/CoinsbitIndia) | [Facebook](https://www.facebook.com/CoinsbitIndia) | [Instagram](https://www.instagram.com/coinsbitindia) | [LinkedIn](https://www.linkedin.com/company/coinsbitindia) | [Medium](https://coinsbitindia.medium.com/) | [Email](mailto:SUPPORT@COINSBIT.IN)\n\n**About MRHB DeFi**\n\nMRHB DeFi is a platform built to embody the true spirit of an “Inclusive DeFi” by promoting participation finance, where all communities, including the ones from the Islamic World, can benefit from the benefits of DeFi.\n\nBased on the tenets of Blockchain such as trust, transparency, and security; MRHB DeFi has encapsulated universally applicable principles of Shariah into those tenets of Blockchain to render a suite of offerings.\n\nMRHB DeFi was founded with the vision of bringing a “Muslim also” platform, rather than making it an exclusive “Muslim only” offering.\n\nWe are a diverse team of researchers, technocrats, influencers, islamic fintech experts & business entrepreneurs, who came together to ensure that MRHB DeFi prevails in a manner that will impact society as a whole, essentially bridging the gap between the Faith-Conscious Communities and the Blockchain world.\n\n**Read more about MRHB DeFi here:**\n\n[Website](https://marhabadefi.com/) | [Twitter](https://twitter.com/marhabadefi) | [Telegram Chat](https://t.me/mdf_official) | [Telegram Announcements](https://t.me/marhabadefi_ANN) | [Medium](https://medium.com/@marhabadefi) | [Documents](https://marhabadefi.com/info-centre.php) | [Facebook](https://facebook.com/marhabadefi) | [LinkedIn](https://www.linkedin.com/company/marhabadefi/) | [Telegram Arabic Community](https://t.me/mdf_arabic)","createdAt":"2022-11-15T20:51:13.972Z","updatedAt":"2022-11-15T20:51:13.972Z","publishedAt":"2022-11-15T20:51:13.967Z","locale":"en","Url":"coinsbit-india--marhaba-partner-to-bring-shariah-compliant-crypto-to-indias-200-million-muslims","meta":"","cover":{"data":{"id":147,"attributes":{"name":"Coinsbit India & Marhaba Partner to Bring Shariah-Compliant Crypto to India’s 200 Million Muslims cover.jpg","alternativeText":null,"caption":null,"width":1400,"height":787,"formats":{"large":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/large_Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b.jpg","hash":"large_Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b","mime":"image/jpeg","name":"large_Coinsbit India & Marhaba Partner to Bring Shariah-Compliant Crypto to India’s 200 Million Muslims cover.jpg","path":null,"size":13.83,"width":1000,"height":562},"small":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/small_Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b.jpg","hash":"small_Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b","mime":"image/jpeg","name":"small_Coinsbit India & Marhaba Partner to Bring Shariah-Compliant Crypto to India’s 200 Million Muslims cover.jpg","path":null,"size":6.05,"width":500,"height":281},"medium":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/medium_Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b.jpg","hash":"medium_Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b","mime":"image/jpeg","name":"medium_Coinsbit India & Marhaba Partner to Bring Shariah-Compliant Crypto to India’s 200 Million Muslims cover.jpg","path":null,"size":9.99,"width":750,"height":422},"thumbnail":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/thumbnail_Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b.jpg","hash":"thumbnail_Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b","mime":"image/jpeg","name":"thumbnail_Coinsbit India & Marhaba Partner to Bring Shariah-Compliant Crypto to India’s 200 Million Muslims cover.jpg","path":null,"size":2.42,"width":245,"height":138}},"hash":"Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b","ext":".jpg","mime":"image/jpeg","size":16.21,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/Coinsbit_India_and_Marhaba_Partner_to_Bring_Shariah_Compliant_Crypto_to_India_s_200_Million_Muslims_cover_2645d5a61b.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:53:15.358Z","updatedAt":"2022-12-28T12:53:15.358Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}