{"pageProps":{"articleData":{"id":31,"attributes":{"title":"How NFTs Drive The Meta Economy","date":"2022-03-24","content":"From London to Dubai, NFTs have been widely discussed and are the latest trend everywhere in the cryptoworld and beyond. The popularity and massive growth that NFTs saw in the past year surprised a lot of people in the blockchain industry. The metaverse economy (meta-economy) is mainly driven by NFTs. Even though NFTs are trending, many still don’t have the clue of what an NFTs is.\n\n## What Is An NFT?\n\nNon-Fungible Token is a term used to describe a token that is irreplaceable. To make it clearer, let’s define the terms (1) non-fungible and (2) token.\n\nA **non-fungible** item is one that is different from any other, unique, and not exchangeable. While a crypto-based **‘token’** is a programmable digital unit of value that is stored on a blockchain. Put another way, NFTs are blockchain-based cryptographic assets with unique identification numbers and metadata files that distinguish them from one another.\n\n## Why Are NFTs Important?\n\nNFTs are largely found in Ethereum’s blockchain infrastructure applying a token standard of ERC-721 and ERC-1155. The two standards relate to the two types of There are broadly two types of art NFTs. Type 721 are a one-of-its-kind NFT, where an artist creates a unique piece and then sells it, just like real-world art sales. Type 1155 are collections, like ‘Cryptopunks’ where artists and developers create many, usually 10,000, NFTs that have the same template with different characteristics with certain combinations being more desirable than others. NFTs can be collectibles, arts, memes, concert tickets and so on and are traded in different marketplaces where creators mint, buy and sell their NFTs. These marketplaces are powered mainly by the Ethereum blockchain. Among the marketplaces are [Opensea](https://opensea.io/), [Rarible](https://rarible.com/), [Foundation](https://foundation.app/), [SouqNFT](https://www.souqnft.com/) and so on.\n\n## Welcome to The Metaverse\n\nThe word metaverse was first coined by Neal Stephenson in 1992 in his book titled “Snow Crash”. He ideates lifelike avatars who met in realistic 3D buildings and other virtual reality environments. **Metaverse** can simply mean a 3D virtual world which integrates Virtual reality (VR) and Augmented reality (AR). Users can customize realistic avatars, meet with other players to hang out and play games, create virtual items, own virtual property and exchange goods and services.\n\nThere is still no dominant metaverse/ecosystem yet and competition is fierce, and each virtual world is scalable, interoperable, versatile and gives room for users to interact with an individual sense of presence and personality. These characteristics coupled with blockchain features of decentralization, immutability, transparency and crucially cryptocurrency, together these make the meta-economy a ‘reality’.\n\n‘Meta-economy’ is a portmanteau of metaverse and economy and can be defined as the large set of inter-related cryptoasset transactions, primarily through the exchange/purchase/sale of NFTs. Currently NFTs are mostly creative assets, but tokenization of real world good and services (property, equities etc) will increasingly blur the lines between the two realities in future.\n\n## The NFT Creative Economy\n\nIn 2021, A digital artwork by the artist Beeple sold for $69 million at Christie’s. Also, at the Sotheby’s Natively Digital auction, the former CEO of Twitter, Jack Dorsey sold his first tweet for $2.9 million. At the same sale, CryptoPunk 7523, one of the randomly generated sets of 10,000 unique digital characters, sold for $11.8 million.\n\nThe sizable amount of money in play has attracted the attention of creators into the NFT marketplaces and make it boom in the blockchain industry. Indeed, for good of for bad artists and other creatives can become their own little capitalist engine.\n\nIt’s clear that reputation, providence and ‘story’ can drive value…as currently most creative NFTs are worth very little reflecting both their lack of any celebrity or narrative compounded by the clear absence of any intrinsic value. Lastly, the immaturity of this space means that plagiarism and ‘wash trading’ (false private transactions to boost the public sale value) remain key issues to broader adoption.\n\nHowever, NFTs are not limited to selling digital artworks and collectibles only. It is also applicable to videos, music, sport and gaming. Even further into the future, property, services and even investments can be part of the utility of NFT.\n\n## NFT Sales Are Climbing\n\nIn 2021 a record $41billion of Ethereum blockchain NFTs was sold with the vast majority (75%) of NFT transactions being sales under $10,000, the market however is heavily concentrated showing the lack of depth in the market as the wealthiest 9% of NFT wallets held around 80% of the market’s entire value. To put this figure into context, the global art market — built over centuries — was worth $50 billion with over 12.4 billion sold online.\n\nLooking at NFT sales in the last 30 days, the market is hitting over 941,000 sales worth $2 billion for an average price of $2200. There are 331,000 active wallets. The top sale was a ubiquitous CryptoPunks sold for 8000 ETH or $24mm. However, there are many issues around accurate reporting of sales with ‘wash trading’ and purchases with ‘flash loans’ a form of price manipulation anecdotally quite common, CryptoPunk #9998, from a collection of 10,000, “sold” at $530 million was one such misleading ‘sale’.\n\nSOURCE [https://nonfungible.com/market/history](https://nonfungible.com/market/history)\n\nThe top sale of NBA’s Top shot to date was sold at the end of August 2021. This was the highlight of LeBron James which was sold for $230,000. And this is also contributed to the sales made in this month.\n\n## How NFTs Can Drive The Gaming Economy\n\nBeyond promoting digital artworks, NFTs are also driving the meta-economy forward both through gaming and trading of virtual land. Much of this is already visible in the $180 billion videogame industry with online worlds having millions of users’ characters and associated transactions — these are already metaverses in a sense. Those worlds that go beyond gaming have broader appeal — so will be larger.  \nDifferent however is the Play-to-Earn (P2E) gaming model. This model of the game does not only engage the players but provides incentives for them i.e., they earn in-game currency as they play which can later be traded for real money which then may even incur taxes like any other sources of income.\n\nThe players also get full ownership of their digital assets instead of being controlled by a single centralised game publisher. Successful examples of such Play-to-earn games include Axie Infinity (AXS), The Sandbox (SAND), My Neighbour Alice (ALICE), Mobox (MBOX) and many others.\n\nIn addition, Play-to-Earn gaming guilds make Play-to-Earn gaming more interesting for investors and aspiring players who don’t have Start-up fees. Guilds act as facilitating intermediaries by purchasing in-game NFT resources including land and assets and lending them out to players who want to use them in their respective virtual world to earn income.\n\nPlay-to-Earn guilds then take a small portion of the earning. A typical example is Yield Guild Games (YGG). By doing this, guilds are promoting the meta-economy through NFTs and driving it forward. The CEO of Yield Guild Games, Dizon also affirmed this in one of his statements. He said “Guilds is creating a new type of metaverse economy where it’s not just people playing. He also hopes that we will see millions of such guilds over time. Each guild can set itself apart with the investments and community infrastructure that it makes, he said.\n\nAll the above has been driven by startups, we can now see how different big tech companies such as **Meta** and **Microsoft** are investing huge amounts of money in the meta-economy. Indeed, Microsoft’s recent $69 billion purchase of gaining titan Activision Blizzard was driven by the thesis that gaming will drive growth of their own metaverse.\n\n## What About Real Estate?\n\nWith NFTs, users can have full ownership of their virtual land(s) and real estate in metaverse. The trading of virtual land NFTs and virtual real estate investment is also contributing to the growth of meta-economy.  \nHaving famously missed the crypto boom, investment bank JPMorgan speculates that the metaverse is a $1 trillion yearly opportunity and hence has becomes he first bank to open in virtual mall ‘Metajuku mall’ in a world called Decentraland. The bank’s lounge features a spiral staircase, a live tiger, and an illuminated portrait of CEO Jamie Dimon.\n\nBlue-chip corps like **Samsung**, **Adidas**, **PricewaterhouseCoopers** and most recently **McDonald** have purchased virtual land. The COO of Crypto.com, Anziani says “real estate investment is another promising NFT investment theme, as underscored by **Sotheby’s** purchase of land for its gallery in Decentraland’s ‘Voiltaire Art District’.\n\nDecentraland has been the most popular 3D virtual reality world powered by the Ethereum blockchain. It offers 90,601 parcels of land. Each parcel is an NFT and measures 16m by 16m. As of March 2021, one Decentraland costs $11,000. Presently, there are 6,466 Decentraland owners. Real estate is another real-world business that have made the virtual transition.\n\n## The Future Is Metaverse\n\nIn conclusion, while metaverse is still in its infancy, it presents numerous potential social investments and opportunities which will be enabled by NFTs. It is still highly immature with high risk but getting into the right metaverse assets now likely means extraordinary wealth creation in the future as they own a piece of a virtual Manhattan.","createdAt":"2022-11-15T20:47:53.932Z","updatedAt":"2023-01-03T04:33:00.480Z","publishedAt":"2022-11-15T20:47:53.926Z","locale":"en","Url":"how-nfts-drive-the-meta-economy","meta":"The popularity and massive growth of NFTs surprised a lot of people in the blockchain industry. How does it drive the meta economy?","cover":{"data":{"id":113,"attributes":{"name":"HOW NFTS CAN DRIVE THE META ECONOMY cover.jpg","alternativeText":null,"caption":null,"width":1440,"height":810,"formats":null,"hash":"HOW_NFTS_CAN_DRIVE_THE_META_ECONOMY_cover_ba09bbc80b","ext":".jpg","mime":"image/jpeg","size":2690.14,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/HOW_NFTS_CAN_DRIVE_THE_META_ECONOMY_cover_ba09bbc80b.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:42:35.001Z","updatedAt":"2022-12-28T12:42:35.001Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}