{"pageProps":{"articleData":{"id":36,"attributes":{"title":"How NFTs Can Empower Artists","date":"2022-01-10","content":"Artists face several issues that make it difficult for people wishing to pursue their art as a career. If you decide to become a plumber or an accountant, it is relatively easy to undertake training or to become an apprentice which would lead to you getting a position in your chosen career. \n\nWhile the training may require a number of years in college or with a master craftsman, typically the person would be able to apply for a job that would happily support their future financial requirements. Basically, you don’t need to be the best plumber in your town to make a comfortable living.\n\n## While the Internet can support Artists, it also adds New Challenges\n\nHowever, artists often face insurmountable challenges even getting to that first step. They finish art college (in some cases) and then they need to try and find galleries, outlets, or other means to showcase and then sell their art. With the emergence of the internet, it was supposed to make it easier for everyone, including artists, to reach their audiences, but increasingly it seems that artists now need to become social media experts to engage effectively with an increasingly populated and busy marketplace. In addition, the internet gave birth to the sharing of content, content that could be easily replicated without the knowledge or financial rewarding of the original artist.\n\n## Industry Challenges Like Art Fraud Continue to Exist\n\nEven those artists who manage to find their way to the top of the pile find that commercial conduits for art take huge percentages of their sales, from galleries to agents to curators.\n\nOn the flip side, while everyone could get a copy of the Mona Lisa to print out and hang on their wall, it was very difficult to provide the provenance of expensive art pieces and art fraud is a huge problem.\n\n## NFTs to the Rescue\n\nSo could NFTs or non-fungible tokens solve all the above problems — from reaching audiences, proving items are genuine, and also providing provenance of digital and physical art? Possibly.\n\nFirst of all a quick 101 on the miracle of NFTs. NFT stands for **non-fungible token**, which basically means that it’s a one-of-a-kind digital asset that belongs to you and you only.\n\nFungibility is both the swapping of and the breaking down of the main item into component parts that equal the same. In economics, a fungible asset is something with units that can be readily interchanged — like money. With money, you can swap a Euro 10 note for another Euro 10 note or two Euro 5 notes and it will have the same value.\n\nAn NFT has unique properties so it can’t be interchanged with something else. And this is why NFT technology is perfect because its non-fungible properties mean that unique art pieces can be individually represented (or as a series).\n\nNFTs will have many uses in the future, some of which have yet to be even thought of. Currently, the most popular NFTs right now include artwork and music but can also include videos, tweets and more.\n\nBeeple’s well-publicised sale of his 5,000 days digital collage reached the epic sale amount of US$69 million with Christies. It did take him 13 years to accumulate all his art but that still gives him an annualised income of almost $5.5 million a year (less Christies fees, so divide by two again).\n\nDigital tokens attached to physical art can also help preserve the provenance of ownership where an art collector might buy an NFT and then receive the physical painting itself.\n\n## Opening Up a Whole New World of Possibilities\n\nHowever, what does it mean for the more ordinary artist, struggling to get a foothold in this crazy world? Whereas Beeple’s famous sale meant the world woke up to NFTs, such high values are in the tiny minority. Most artists would be mistaken to think they might achieve such pricing — unless they are already very well known. However, all is not lost, NFTs provide an opening for regular artists to find new audiences, reduce fees to 10% or less and also embed royalties for the lifetime of the artwork.\n\nThe lifetime royalties are managed by smart contracts and typically allow for a 10% fee for all future sales to be sent back to the original artist — again removing the anarchic art regime where collectors make money from reselling art but no future profits are ever returned to the artist. These royalties are all managed automatically without the need for human intervention due to the smart contracts.\n\nConsider up and coming American artist Crypto Yuna. A mother of three, she is a self-taught artist who started using traditional methods such as acrylics on canvas. The more she learned, the more she began to push the boundaries.\n\nAs her name suggests, Crypto Yuna was very aware of NFTs when they emerged, so she decided to try her hand at digital art.\n\n“It opened up a whole new world of art to me. I found I really enjoyed it and moreover my digital art, my NFTs, began selling very well.”\n\nShe also likes the freedom that she can create one limited edition or many versions.\n\n“Using blockchain means I can prove that I am only minting one or many — it’s about creating trust.”\n\nSince she has started creating NFTs, she has moved from being the stay-at-home mum who paints and contributes to the family income, to becoming the main breadwinner.\n\n“To be able to earn an income from doing what I love is amazing!” she says.\n\n## Souq NFT Marketplace Powered by MRHB DeFi\n\nIf you are an artist who is looking for the best way to leverage NFT technology and start selling your artwork on a marketplace that is ethical, MRHB DeFi has created the [Souq NFT marketplace](https://souq.mrhb.network/) for you. The Souq NFT platform follows halal image, audio and video content guidelines such as no hate speech, racism or nudity.\n\nCreated with the desire to empower ethical artists, Souq NFT provides the platform, technology, tools and community for you to both display and sell your artwork on a non-NSFW, user-friendly platform and interface.\n\n### MRHB DeFi Official Channels\n\n[Website](https://mrhb.network/)| [MRHB Reward Dashboard](https://rewards.mrhb.network/) | [Twitter](https://twitter.com/marhabadefi) | [Telegram Chat](https://t.me/mdf_official) | [Telegram Announcements](https://t.me/marhabadefi_ANN) | [Medium](https://medium.com/@mrhbdefi) | [Documents](https://marhabadefi.com/info-centre.php) | [Facebook](https://www.facebook.com/MRHB-DeFi-105893235209147/) | [LinkedIn](https://www.linkedin.com/company/marhabadefi/) | [Telegram Arabic Community](https://t.me/mdf_arabic) | [Russian Community](https://t.me/mdf_russia) | [Turkish Community](https://t.me/MarhabaDefiTR) |[Persian Community](https://t.me/mrhbdefi_persian) | [Urdu/Hindi Community](https://t.me/MRHBDeFi_Urdu_Hindi)","createdAt":"2022-11-15T20:48:40.603Z","updatedAt":"2023-01-03T08:02:07.681Z","publishedAt":"2022-11-15T20:48:40.598Z","locale":"en","Url":"how-nfts-can-empower-artists","meta":"Challenges like art fraud continue to exist but with NFTs, this could change. Learn how NFTs can empower artists.","cover":{"data":{"id":118,"attributes":{"name":"How NFTs Can Empower Artists cover.jpg","alternativeText":null,"caption":null,"width":1200,"height":650,"formats":{"large":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/large_How_NF_Ts_Can_Empower_Artists_cover_f643e361e2.jpg","hash":"large_How_NF_Ts_Can_Empower_Artists_cover_f643e361e2","mime":"image/jpeg","name":"large_How NFTs Can Empower Artists cover.jpg","path":null,"size":56.29,"width":1000,"height":542},"small":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/small_How_NF_Ts_Can_Empower_Artists_cover_f643e361e2.jpg","hash":"small_How_NF_Ts_Can_Empower_Artists_cover_f643e361e2","mime":"image/jpeg","name":"small_How NFTs Can Empower Artists cover.jpg","path":null,"size":18.42,"width":500,"height":271},"medium":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/medium_How_NF_Ts_Can_Empower_Artists_cover_f643e361e2.jpg","hash":"medium_How_NF_Ts_Can_Empower_Artists_cover_f643e361e2","mime":"image/jpeg","name":"medium_How NFTs Can Empower Artists cover.jpg","path":null,"size":36.28,"width":750,"height":406},"thumbnail":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/thumbnail_How_NF_Ts_Can_Empower_Artists_cover_f643e361e2.jpg","hash":"thumbnail_How_NF_Ts_Can_Empower_Artists_cover_f643e361e2","mime":"image/jpeg","name":"thumbnail_How NFTs Can Empower Artists cover.jpg","path":null,"size":5.27,"width":245,"height":133}},"hash":"How_NF_Ts_Can_Empower_Artists_cover_f643e361e2","ext":".jpg","mime":"image/jpeg","size":68.3,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/How_NF_Ts_Can_Empower_Artists_cover_f643e361e2.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:43:14.028Z","updatedAt":"2022-12-28T12:43:14.028Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}