{"pageProps":{"articleData":{"id":14,"attributes":{"title":"How MRHB is Building a Halal and Ethical DeFi Ecosystem","date":"2022-10-20","content":"Are you looking to invest in cryptocurrency without having to worry about it being halal or not? Well, look no further — MRHB has your back.\n\nIn January, [Nasdaq listed MRHB in the top 7 killer cryptos](https://www.nasdaq.com/articles/7-killer-cryptos-to-buy-for-january) amongst 34,000 contenders.\n\nLaunched on February 22, 2022, the Sahal Wallet has been revolutionizing the world of crypto. Here’s a brief primer on MRHB (pronounced ‘Marhaba’) and its cryptocurrency.\n\n## What Is MRHB DeFi\n\n[MRHB DeFi](https://mrhb.network/) is a blockchain project founded by Naquib Mohammed, aiming to provide an ethical ecosystem for cryptocurrencies.\n\n**$MRHB** is a first-of-its-kind **halal crypto** token developed based on Islamic principles. It operates on an open-source blockchain and has undergone a rigorous peer-review process by world-class technical experts, economists, and scholars.\n\n>“While challenges remain, the emergence of open blockchains has at last allowed us to reimagine what financial systems of the future can be like,” says [Khalid Howladar](https://mrhb.network/team.html), chairman of MRHB.\n\n**Revolutionary ecosystems like MRHB are paving the way towards the decentralization of economic activities.**\n\nWhat’s more, MRHB’s permissionless platform does not restrict access based on location, wealth, or legal status, unlike existing traditional financial institutions.\n\nFinancial applications that run on distributed ledger technology, known as decentralized applications (DApps), duplicate all their records across thousands of nodes/computers, thus facilitating reliable, transparent, and trustless peer-to-peer transactions.\n\nWith blockchain technology guided by ethics, we hope to push value creation to the bottom of the income pyramid rather than being leveraged by the affluent elites at the top.\n\n## How Is $MRHB Different from Other Altcoins?\n\n**$MRHB** is the world’s first **halal crypto token** that aims to tackle conventional interest-bearing products of traditional finance. With that, we endeavor to build original **halal DeFi products** rather than copying conventional interest-based lending models.\n\nThe Shariah Governance Board (SGB) ensures that the issuance of $MRHB, its usage features, current and future benefits, and its rights, will **comply with Islamic ethical standards**. These elements create the utility of the Token, which in turn forms the primary source of value.\n\n$MRHB also serves as a **means of payment** in the ecosystem and will also be used as a **governance token** in the future.\n\n## The MRHB Ecosystem\n\nIslam is the second-largest religion globally. While cryptocurrency has been steadily growing since 2008 and NFTs have been making waves in recent years, the global Muslim community is still lagging behind in terms of crypto adoption.\n\nThis is mainly because of concerns in terms of whether or not a cryptocurrency or protocol is halal. This is why there needs to be a DeFi solution that tackles this issue. As such, MRHB has been built to fill the gap, offering halal and ethical interactions with crypto and [Web3](https://medium.com/intro-to-web3-decentralized-web3-vs-web-3-0-semantic-web-db3bc46458de) technologies.\n\n> The MRHB Ecosystem is built on top of the world’s best-in-class open-source technology, ensuring maximum reliability, performance scalability, and security.\n\nHowever, we are not just skirting around interest.\n\nWe’re developing an array of DApps to build a halal DeFi ecosystem.\n\n### MRHB Products for the Growth of Halal DeFi Ecosystem\n\n1.  **Sahal Wallet:** A multi-asset non-custodial wallet that would hold only shariah-compliant tokens or assets with token swapping features.\n2.  **Souq NFT:** A multichain solution for both B2X and C2X use cases. While initially focused on creative endeavors, the platform potential for the efficient exchange of unique and halal tangible value is immense.\n3.  **TijarX:** A decentralized commodity exchange where you can buy and sell asset-backed tokens like gold and silver.\n4.  **Liquidity Harvester:** A crypto-wealth product that offers solid and halal token returns with reduced risk for individuals and institutions relative to the current centralized finance products.\n5.  **M.I.R.O.:** A fixed staking model that gives rewards and voting power to users who stake $MRHB. The longer a user stakes their $MRHB, the more voting power they get, the higher the pro-rata share of reward distribution obtained.\n6.  **Cross-Chain DEX Aggregator:** Blockchain agnostic with the function to consolidate the liquidity fragmented across the DeFi ecosystem for more efficient markets.\n7.  **Decentralized Philanthropy:** A DeFi protocol that is fully auditable and ZKP-based to facilitate charitable Zakat and Waqf-related activities on the blockchain.\n8.  **Halal Staking:** An Interest-free financing solution for crypto assets.\n9.  **Launchpad:** A community-driven launchpad designed to be a democratic platform for entrepreneurs protected from crypto WHALEs and bot manipulation based on Quadratic Funding.\n10.  **NFT Impact Investment:** A platform that encourages the funding of impactful social and environmental initiatives via the collection of non-fungible tokens.\n\nLooking at the long-term, MRHB plans to become a Public Blockchain on the Polkadot ecosystem. Having our own chain will give the developers a range of economic options to grow the product line and offer better financial incentives for the community.\n\n## Cynicism Around Cryptocurrency\n\nIn the token economy, the digital democracy is driven by the sovereign individual — you and me!\n\nHowever, concerning faith, we believe that none of the current DeFi protocols create a halal or ethical ecosystem that meets the needs of 1 billion-plus Muslims and faith-based people globally. At the moment, [1.7 billion people remain unbanked](https://globalfindex.worldbank.org/sites/globalfindex/files/chapters/2017%20Findex%20full%20report_chapter2.pdf#:~:text=Globally%2C%20about%201.7%20billion%20adults%20remain%20unbanked%E2%80%94without%20an,ally%20all%20unbanked%20adults%20live%20in%20developing%20economies.) or without mobile money facilities.\n\nIn terms of complexity, even in a UK market where financial literacy is high, [74% say they don’t understand cryptocurrency](https://yougov.co.uk/topics/finance/articles-reports/2020/08/28/how-do-britons-view-cryptocurrencies). And even if they do understand, 46–52% say they [don’t trust the technology](https://www.thestreet.com/investing/i-dont-trust-bitcoin-but-should-i-give-up-on-crypto).\n\nOnly [3% of the global population participate in the crypto market](https://markets.businessinsider.com/news/currencies/crypto-investing-buy-bitcoin-adoption-hyper-inflection-point-wells-fargo-2022-2). Complexity, cynicism, and risk create a massive barrier to market participation thereby excluding most of the world’s financially active population.\n\nIronically though, these challenges contrast sharply with the digital world, where [83% of global executives](https://modernconsensus.com/cryptocurrencies/watch-out-fiat-83-think-digital-assets-will-be-an-alternative-or-a-replacement/) believe that cryptocurrency will replace fiat currency in the next 5–10 years.\n\n## Supporting the Unbanked and Faith-Based Communities\n\nThe idea of an ethical DeFi ecosystem is to remove the redundant middlemen so that transactions can be done **faster and cheaper.**\n\nFurthermore, using cryptographic technology and creating a decentralized finance ecosystem would allow **equal access** to ethical financial products.\n\nMRHB is on a mission to provide inclusive and ethical access to interest-free DeFi opportunities on web3 through safe and simple platforms for faith-based communities, thus bringing everyone safely into DeFi.\n\nTo [get started](https://mrhb.network/get-started) on this DeFi revolution with MRHB, download [Sahal Wallet](https://mrhb.network/ecosystem/sahal-wallet) to access the entire MRHB Ecosystem.","createdAt":"2022-11-15T20:24:40.100Z","updatedAt":"2022-12-12T06:39:32.312Z","publishedAt":"2022-11-15T20:24:40.094Z","locale":"en","Url":"how-mrhb-is-building-a-halal-and-ethical-defi-ecosystem","meta":"The world’s first interest-free, halal, ethical web3 decentralized finance ecosystem. Get to know MRHB and its range of halal DeFi products.","cover":{"data":{"id":94,"attributes":{"name":"How MRHB is Building a Halal and Ethical DeFi Ecosystem cover.jpg","alternativeText":null,"caption":null,"width":1400,"height":787,"formats":{"large":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/large_How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886.jpg","hash":"large_How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886","mime":"image/jpeg","name":"large_How MRHB is Building a Halal and Ethical DeFi Ecosystem cover.jpg","path":null,"size":33.76,"width":1000,"height":562},"small":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/small_How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886.jpg","hash":"small_How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886","mime":"image/jpeg","name":"small_How MRHB is Building a Halal and Ethical DeFi Ecosystem cover.jpg","path":null,"size":13.88,"width":500,"height":281},"medium":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/medium_How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886.jpg","hash":"medium_How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886","mime":"image/jpeg","name":"medium_How MRHB is Building a Halal and Ethical DeFi Ecosystem cover.jpg","path":null,"size":23.49,"width":750,"height":422},"thumbnail":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/thumbnail_How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886.jpg","hash":"thumbnail_How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886","mime":"image/jpeg","name":"thumbnail_How MRHB is Building a Halal and Ethical DeFi Ecosystem cover.jpg","path":null,"size":5.34,"width":245,"height":138}},"hash":"How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886","ext":".jpg","mime":"image/jpeg","size":42.63,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/How_MRHB_is_Building_a_Halal_and_Ethical_De_Fi_Ecosystem_cover_18897ed886.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:33:59.482Z","updatedAt":"2022-12-28T12:33:59.482Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}