{"pageProps":{"articleData":{"id":24,"attributes":{"title":"MRHB’s Naquib Mohammed to participate at the Halal in Travel (HIT) Global Summit 2022","date":"2022-05-30","content":"The 2nd edition of Halal in Travel (HIT) Global Summit is here — from 31st May to 2nd June — and the premier global event on Halal tourism has an exciting lineup of speakers for you!\n\nH.E. Aziz Abduhakimov (Deputy Prime Minister and Minister of Tourism and Cultural Heritage, Republic of Uzbekistan), H.E. Dr. Sandiaga Salahuddin Uno (Minister of Tourism and Creative Economy, Republic of Indonesia), H.E. Dato’ Sri Hajah Nancy Shukri (Minister of Tourism, Arts & Culture, Malaysia), H.E. Abdulla Mausoom (Minister of Tourism, Republic of Maldives), Keith Tan (Chief Executive at the Singapore Tourism Board) and other industry experts will gather together to explore ways to invigorate the muslim travel market.\n\n**Founder and CEO of MRHB DeFi network,** [**Naquib Mohammed**](https://au.linkedin.com/in/mohammednaquib) **will be a part of the panel discussion on “The Role of Blockchain and Crypto in the Muslim Lifestyle Space” and will be talking about the key areas in which crypto can redefine Muslim lifestyles as well as the intersection of blockchain technology and travel/tourism.**\n\n**Details of Panel Discussion**\n\nDate: 2nd June, 2022\n\nTime: 04:05 PM — 04:55 PM (+08)\n\n**Register now for the Halal in Travel event:**\n\n[https://events.crescentrating.com/HalalInTravel-GlobalSummit2022#/](https://events.crescentrating.com/HalalInTravel-GlobalSummit2022#/)\n\nAs more travelers prepare for international travel after a long hiatus (due to covid), this conference aims to discuss ideas that enable recovery in the muslim travel market. Experts from National Tourism Organisations, travel industry stakeholders, and key players in the online travel segment will gather to share insights on responsible travel for Muslims.\n\nSince travel constitutes a major part of the Muslim lifestyle space and Islamic economy, the Summit sheds light on how to ease core processes in the travel sector, making it more efficient and organised.\n\n**About MRHB DeFi:**\n\nMRHB DeFi is a decentralised finance platform that is built to facilitate the inclusion of faith-based and other excluded communities into the financial system. Based on the tenets of blockchain — such as trust, transparency, and security — MRHB DeFi has encapsulated universally applicable principles of Islamic Finance to render a suite of offerings that are also ESG compliant.\n\nMRHB DeFi Official Channels\n\n[Website](https://mrhb.network/)| [MRHB Reward Dashboard](https://rewards.mrhb.network/) | [Twitter](https://twitter.com/marhabadefi) | [Telegram Chat](https://t.me/mdf_official) | [Telegram Announcements](https://t.me/marhabadefi_ANN) | [Medium](https://medium.com/@mrhbdefi) | [Documents](https://marhabadefi.com/info-centre.php) | [Facebook](https://www.facebook.com/MRHB-DeFi-105893235209147/) | [LinkedIn](https://www.linkedin.com/company/marhabadefi/) | [Telegram Arabic Community](https://t.me/mdf_arabic) | [Russian Community](https://t.me/mdf_russia) | [Turkish Community](https://t.me/MarhabaDefiTR) |[Persian Community](https://t.me/mrhbdefi_persian) | [Urdu/Hindi Community](https://t.me/MRHBDeFi_Urdu_Hindi)","createdAt":"2022-11-15T20:43:53.622Z","updatedAt":"2022-12-23T07:13:43.143Z","publishedAt":"2022-11-15T20:43:53.617Z","locale":"en","Url":"mrhb-naquib-mohammed-to-participate-at-the-halal-in-travel-hit-global-summit-2022","meta":"The 2nd edition of Halal in Travel (HIT) Global Summit is the premier global event on Halal tourism with MRHB CEO as panel speaker.","cover":{"data":{"id":105,"attributes":{"name":"MRHB’s Naquib Mohammed to participate at the Halal in Travel (HIT) Global Summit 2022 cover.jpg","alternativeText":null,"caption":null,"width":1200,"height":650,"formats":null,"hash":"MRHB_s_Naquib_Mohammed_to_participate_at_the_Halal_in_Travel_HIT_Global_Summit_2022_cover_04fa6a60e0","ext":".jpg","mime":"image/jpeg","size":269.37,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/MRHB_s_Naquib_Mohammed_to_participate_at_the_Halal_in_Travel_HIT_Global_Summit_2022_cover_04fa6a60e0.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:37:27.366Z","updatedAt":"2022-12-28T12:37:27.366Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}