{"pageProps":{"articleData":{"id":25,"attributes":{"title":"Proof-of-work: The Trade-off Between Security and Sustainability","date":"2022-04-20","content":"During the inception of cryptocurrency, a central idea that needed to be carried out was _de_-centralization. This was necessary to ensure that financial institutions and authorities would not be required to run the ecosystem. One of the first solutions that emerged, put forward by Bitcoin was called proof-of-work (PoW).\n\n## Understanding Proof-of-work\n\nProof-of-work refers to a widespread network of blockchains that are periodically secured by new blocks of transactions. The “work” generates a math puzzle or hash, that virtual miners around the world race to finish first. The winner is awarded the ability to add to the blockchain and reap the predetermined reward of cryptocurrency.\n\nPoW in cryptocurrency has proven to be a robust way of maintaining secure blockchains, as finding the target answer is difficult but verifying it is not. Additionally, the amount of processing power required to meddle with a blockchain is impractical and redundant, hence adding to its security.\n\nThe proof-of-work algorithm is also very accommodating; if mining happens too frequently the puzzle becomes harder, and if it is going too slowly it gets easier.\n\n## EU’s Parliamentary Decision on PoW\n\nSince mining is a continuous process that requires constant power, miners have progressively upgraded their hardware to increase their chances of solving the puzzle compared to their opponents. Many discussions ensued around the world discussing its sustainability, which led to the Markets in Crypto Assets (MiCA) framework. MiCA is the European Union’s proposed legal framework for managing virtual currencies. One of the draft provisions suggested a ban on Proof-of-Work mining, and the Economic and Monetary Affairs Committee of the EU recently took a vote on the provision. A final tally of the voting resulted in the clause being rejected, with 23 votes in favor, 30 against, and 6 abstaining votes.\n\nThis spread waves of relief in the cryptocurrency community, as the proposal going through could have completely upended the existing system in place. Many industrial experts feared that the blanket ban would inadvertently affect cryptocurrency exchanges, miners, and various indirect firms across the industry in irrevocable ways.\n\n**_…But what about sustainability?_**\n\nCryptocurrency’s energy consumption has been a hot topic all over the world. Industry experts and supporters are starting to encourage miners to use renewable sources of energy for mining, in an attempt to reduce their carbon footprint.\n\n## Are There Alternatives?\n\nIn response, the crypto-industry has been actively working on solving its environmental problems for years now. Several alternatives have been considered for Proof-of-Work, the most popular being Proof-of-Stake.\n\nEthereum, one of the world’s biggest blockchains, has been slowly yet consistently shifting to Proof-of-Stake recently and hopes to make PoS its main mode of verification by the summer of 2022. If the shift proves to be successful, many other blockchains will follow suit and chart similar plans of action.\n\nThe recent vote on the MiCA framework ensures that Proof-of-Work mining can at least continue in Europe until a revised regulatory draft is proposed to the European Parliament again. A draft containing better solutions for addressing sustainability concerns in the crypto-industry, which could also contribute to developing the industry itself. In the meantime, constant evolution in the crypto industry continue to lead to solutions that are not only secure but also environment-friendly.","createdAt":"2022-11-15T20:44:00.660Z","updatedAt":"2023-01-03T04:18:16.009Z","publishedAt":"2022-11-15T20:44:00.655Z","locale":"en","Url":"proof-of-work-the-trade-off-between-security-and-sustainability","meta":"Does Proof-of-Work (PoW) contribute positively to decentralization? It's proven to be secure and robust but can it be sustainable?","cover":{"data":{"id":106,"attributes":{"name":"Proof-of-work: The Trade-off Between Security and Sustainability cover.jpg","alternativeText":null,"caption":null,"width":1440,"height":810,"formats":null,"hash":"Proof_of_work_The_Trade_off_Between_Security_and_Sustainability_cover_68d886d8d8","ext":".jpg","mime":"image/jpeg","size":552.78,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/Proof_of_work_The_Trade_off_Between_Security_and_Sustainability_cover_68d886d8d8.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:37:35.358Z","updatedAt":"2022-12-28T12:37:35.358Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}