{"pageProps":{"articleData":{"id":23,"attributes":{"title":"Refer Your Friends to MRHB’s Sahal Wallet and Earn Rewards!","date":"2022-06-19","content":"Do you have any friends or family interested in cryptocurrency but not sure where to start? We are launching our official referral whitelist — introduce new members to our community and be rewarded with up to 600 MRHB tokens per referral!\n\n**Deadline:** This referral whitelist is only open from June 20th to July 10th.\n\n**Rewards:** Three lucky winners with the highest number of eligible referrals will be respectively rewarded with 600, 500 and 400 MRHB per referral. All other participants will receive 300 MRHB tokens per referral.\n\n**It’s easy to participate:**\n\n*   Join the MRHB DeFi Network [discord](https://discord.com/invite/TFMvzxBHqZ) server\n*   Download the Sahal Wallet app on [iOS](https://apps.apple.com/ae/app/sahal-wallet/id1602366920) or [Android](https://play.google.com/store/apps/details?id=sahal.wallet.app&hl=en&gl=US)\n*   Fill out [this form](https://docs.google.com/forms/d/e/1FAIpQLSfwj1zLlMjuAw0eF2bdsndt6guigzEGs4Rv7FJ2U1qrDmzj-g/viewform) and create a list of friends you want to refer\n*   Rewards will be airdropped to your Sahal Wallet account 8–10 days after the referral whitelisting ends\n*   Don’t forget to read the ‘Terms & Conditions’ below\n\n**Everybody wins in this referral competition**!\n\nWhen you refer a friend to MRHB, both you and your friend will be rewarded with an equal number of MRHB tokens. Just make sure not to uninstall Sahal Wallet by accident, or you may not receive your reward at the end of the referral whitelist competition.\n\n**Welcome to the World of Halal DeFi**\n\nMRHB DeFi is the world’s first decentralized finance ecosystem that is built from the ground up to ensure our products and services are halal and ethical. This means we’re especially committed to only promoting business practices that adhere to the highest standards.\n\nWe launched our MRHB token (pronounced ‘Marhaba’, meaning ‘welcome’ in Arabic) in December 2021, and we have already released two great halal products for our community of more than 60,000 enthusiastic supporters. What’s more, we have a very ambitious roadmap through 2022 and 2023, meaning, there is a very good chance our DeFi token may appreciate quicker than most!\n\n**An All-Star Platform of Industry-First Halal Finance Products**\n\nProducts currently available on MRHB DeFi Network include:\n\n[**Sahal Wallet**](https://finance.yahoo.com/news/mrhb-defi-launches-sahal-wallet-142600061.html)**:** A self-custodial cross-chain crypto wallet that hosts halal tokens and acts as a gateway portal to the MRHB DeFi platform’s entire ecosystem of halal products.\n\n[**SouqNFT Marketplace**](https://www.souqnft.com): An NFT market that hosts NFTs that have passed a rigorous halal vetting process. SouqNFT also hosts the world’s first [NFT-based halal compliance certificates](https://finance.yahoo.com/news/shariah-experts-ltd-issued-world-123600482.html), issued by Shariah Experts.\n\nThree major solutions are coming soon (within 2022), and are all hotly anticipated:\n\n**Liquidity Harvester**: Passive income/wealth generator. A manual V1 was just launched, with automated features to be added in V2 later this year.\n\n**M.I.R.O.**: Marhaba Incentivization & Reward Offerings, a.k.a. M.I.R.O., is the world’s first halal DeFi staking solution. It implements tiered rewards for incentivizing token lockup and integrates with the Liquidity Harvester.\n\n**CommDex**: A decentralized exchange specifically built for commodity-backed tokens to be integrated on Sahal. Will launch with gold and silver bullion-backed tokens, with plans to roll out other commodity tokens at a later date.\n\n**Don’t Miss Our Referral Competition: June 20th to July 10th**\n\nWe’ll only keep our referral whitelist open for a limited time, so don’t miss out on this opportunity! Just join our [Discord](https://discord.com/invite/TFMvzxBHqZ), download our wallet ([iOS](https://apps.apple.com/ae/app/sahal-wallet/id1602366920)/[Android](https://play.google.com/store/apps/details?id=sahal.wallet.app&hl=en&gl=US)) and fill out [this form](https://docs.google.com/forms/d/e/1FAIpQLSfwj1zLlMjuAw0eF2bdsndt6guigzEGs4Rv7FJ2U1qrDmzj-g/viewform) to qualify. And if you need some information to share with your friends to help explain MRHB DeFi and our referral whitelist competition, please feel free to share this blog post. Good luck!\n\nFor more information about MRHB DeFi Network, please only refer to the following official channels:\n\n[Website](https://mrhb.network/)| [MRHB Reward Dashboard](https://rewards.mrhb.network/) | [Twitter](https://twitter.com/marhabadefi) | [Discord](https://discord.com/invite/TFMvzxBHqZ) | [Telegram Chat](https://t.me/mdf_official) | [Telegram Announcements](https://t.me/marhabadefi_ANN) | [Medium](https://medium.com/@mrhbdefi) | [Documents](https://marhabadefi.com/info-centre.php) | [Facebook](https://www.facebook.com/MRHB-DeFi-105893235209147/) | [LinkedIn](https://www.linkedin.com/company/marhabadefi/) | [Telegram Arabic Community](https://t.me/mdf_arabic) | [Russian Community](https://t.me/mdf_russia) | [Turkish Community](https://t.me/MarhabaDefiTR) | [Persian Community](https://t.me/mrhbdefi_persian) | [Urdu/Hindi Community](https://t.me/MRHBDeFi_Urdu_Hindi)\n\n**TERMS AND CONDITIONS**\n\n**MRHB DeFi Network Whitelist Referral Competition**\n\n1\\. The Whitelist Referral competition (the “Campaign”) is conducted by MRHB DeFi Network during the period from 20th June 2022 00:00 AM GMT+7 to 10th July 2020 11:59 PM GMT+7 (the “Campaign Period”). The Campaign will be open to all existing users of our community.\n\n2\\. This Campaign is a special limited-time promotion offered to both Referrers and Referrals prior to the launch of the [In-app Referral Program](https://help.liquid.com/en/articles/2397941-liquid-referral-program-terms-conditions). Campaign mechanics are as follows:\n\n(i) Participants must meet all conditions indicated in the following form: [https://forms.gle/hJtXQt8RiZtAxuo7A](https://forms.gle/hJtXQt8RiZtAxuo7A)\n\n(ii) Each participant must have a valid MRHB wallet address and is allowed only one entry in the competition.\n\n(iii) Referrals must be real profiles and cannot be existing wallet users.\n\n(iv) Three lucky winners with the highest number of eligible referrals will win 600, 500 and 400 MRHB respectively per referral and their referrals will get the same amount of MRHB tokens.\n\n(v) Other participants except the three winners will be rewarded 300 MRHB tokens per eligible referral. Their referrals will also get 300 MRHB tokens each.\n\n(vi) Payments in MRHB tokens will be credited in each participant’s wallet 8–10 days after the end of the competition.\n\n3\\. The Organiser reserves the right, in its sole and absolute discretion, to disqualify or prohibit a Participant, Referrer or any other person from participating or qualifying in any aspect of the Campaign for any reason, including without limitation if the Organiser deems or suspects that such person:\n\n3.1 Has acted in violation of these terms and conditions, the MRHB Terms of Use, or any other agreement entered into with the Organiser (whether in relation to this Campaign or otherwise);\n\n3.2 Has engaged in conduct that the Organiser considers inappropriate or unacceptable, which includes (without limitation) conduct inconsistent with the intended operation or purpose of the Campaign as determined by the Organiser.\n\nFor avoidance of doubt, Participants or Referrers who engage in prohibited conduct through fake duplicates will be automatically disqualified from all aspects of the Competition.\n\n4\\. If any Participant or Referrer is discovered or deemed to be ineligible for the Campaign for any reason, or is prohibited or disqualified under Clause (v), the Organiser is entitled to forfeit, withdraw or withhold any or all parts of the Prize at any time.\n\n5\\. This Campaign is not valid in conjunction with other campaigns, offers or promotions unless otherwise stated.\n\n6\\. The Organiser reserves the right to cancel, withdraw or amend any aspect of the Campaign or these terms and conditions at its sole and absolute discretion without liability to any person.\n\n7\\. This Campaign and these terms and conditions are governed by the laws of Australia and are subject to the exclusive jurisdiction of the Australian courts.\n\n8\\. By participating in the Campaign, the Participant represents and acknowledges that he or she has read, understood and agrees to be bound by these terms and conditions and by all decisions of the Organiser without limitation or qualification.","createdAt":"2022-11-15T20:43:43.499Z","updatedAt":"2022-12-23T07:05:30.577Z","publishedAt":"2022-11-15T20:43:43.493Z","locale":"en","Url":"refer-your-friends-to-mrhb-sahal-wallet-and-earn-rewards","meta":"Do you have any friends or family interested in cryptocurrency but not sure where to start? We are launching our official referral whitelist.","cover":{"data":{"id":104,"attributes":{"name":"Refer Your Friends to MRHB’s Sahal Wallet and Earn Rewards! cover.jpg","alternativeText":null,"caption":null,"width":1440,"height":810,"formats":null,"hash":"Refer_Your_Friends_to_MRHB_s_Sahal_Wallet_and_Earn_Rewards_cover_911f0de542","ext":".jpg","mime":"image/jpeg","size":2882.01,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/Refer_Your_Friends_to_MRHB_s_Sahal_Wallet_and_Earn_Rewards_cover_911f0de542.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:37:20.315Z","updatedAt":"2022-12-28T12:37:20.315Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}