{"pageProps":{"articleData":{"id":28,"attributes":{"title":"Sahal Wallet — The first ethical and halal crypto wallet and gateway to the MRHB Network ecosystem","date":"2022-04-05","content":"_Introducing Sahal (Easy) Wallet — the world’s first crypto wallet to incorporate ethical and halal crypto asset screening._\n\nIn a decentralized system, individuals need to be responsible for the custody of their own crypto assets, unlike in a centralized exchange or a bank in a centralized financial system where a third party ‘holds’ your assets on your behalf.\n\n**Self custody** is achieved by having your own crypto wallet with your **own private keys** to keep it secure. Once accessed, you can store, purchase, sell, and transfer cryptocurrencies in and out via the relevant blockchain.\n\nIn summary, there are two types of wallets available:\n\n1.  A custodial wallet is managed by a third party who effectively has your keys.\n2.  A self-custody (or non-custodial) wallet is managed solely by the user with their own private keys.\n\n## Introducing Sahal Wallet\n\nLooking for an easy-to-operate self custody wallet that offers frictionless access to ethical and halal crypto assets?\n\nMRHB DeFi, a halal crypto ecosystem has created the Sahal Wallet.\n\nSahal (an Arabic word for “easy”) is a **halal self-custody wallet** that was specifically built to remove of investment confusion and friction currently surrounding the ‘fraudulent’, ‘haram’ and cynical perceptions of cryptocurrencies and support the existing $3 trillion community looking for a safer, more ethical way to enter the cryptoverse.\n\nSahal has been designed with a in-built **screening framework that filters out the coins, tokens and protocols with interest-based returns or that are linked to business activities deemed unethical** such as gambling, pornography and any other unethical (non-halal) or exploitative activities/projects.\n\nThis wallet also serves as the **gateway to the entire MRHB DeFi ecosystem**. \n\nThe pioneering ecosystem will house ten halal products such as Souq NFT, Liquidity Harvester, Entrepreneur Launchpad, and interest-free lending and borrowing among others. \n\nIn providing the above, Sahal will bring in millions of ethically conscious and faith-based investors and their communities into crypto.\n\n## How Does Sahal Wallet Work?\n\nAs a self-custody wallet, Sahal gives users complete control over their crypto assets, private keys, and seed phrases without the need for a third party. This lowers the chances of data being stolen or breached.\n\nHowever, if the user’s seed phrase and private keys are lost, the user’s funds will be inaccessible to both the user and the wallet providers. Sahal wallet is open source meaning its code is available for people to check the principles for any bugs or malwares.\n\nUnlike many other self-custody (or non-custodial) wallets, which have more complicated user interfaces, Sahal is **elegantly designed with simpler interfaces**, making it more user-friendly and easy to manage than other non-custodial wallets.\n\n## Key Features of Sahal Wallet\n\n*   **Halal Crypto Assets**\n\nThe most notable feature of Sahal wallet is its ability to filter, invest and store halal crypto assets. The wallet uses MRHB’s proprietary screening process, which is managed by the Shariah Governance Board (SGB). Only halal tokens can be stored, exchanged, and transacted by users.\n\n*   **Multichain Token Support**\n\nThe Sahal wallet is a cross-chain mobile wallet that supports a wide range of cryptocurrencies and tokens on several blockchains due to its multichain feature.\n\nMultichain (formally known as Anyswap) is developed mainly for cross-chain interactions. It currently allows for around 30 blockchains and over 1300 tokens to inter-operate and enables its users to swap between any two chains freely at cheaper rates.\n\nAccording to Coinmarketcap, the price of Multichain is $9.04. Its total value locked (TVL) is more than 5 million and total supply is 100 million with over 18 million circulating supply. It is unsurpassed in terms of speed, security and decentralisation.\n\n*   **User Friendliness**\n\nSahal wallet is elegantly designed with a simplified interface making it more friendly and easier for its users.\n\n*   **Token Swap**\n\nAnother great yet easy-to-use Sahal wallet feature is its token swap feature. Users can exchange one cryptocurrency to another easily without having to first undertake a crypto-to-fiat exchange or leave the wallet.\n\n*   **Wallet Connect**\n\nYou can connect your Sahal wallet to various DApps and NFT marketplaces.\n\n*   **Customer Support Team**\n\nThere is a standby customer support team that attends to Sahal wallet users if they have any issues related to their wallets.\n\n## How to Install Sahal Wallet\n\nSahal wallet is accessible as a mobile app for Android and iOS users on the Google Play Store and App Store, respectively. To download Sahal, go to the Google Play Store or the Apple App Store and select “install.” Open the Sahal wallet app after the installation is complete.\n\nInitially, you have two choices. You have the option of creating a new wallet or importing an existing one. Your seed phrase of twelve words will appear when you create a new wallet. Make a note of it and save it safely. **_If you lose access to your wallet and do not have your seed phrase, you will be unable to recover your crypto assets._**\n\nYou’ll need to re-enter your seed phrase in the correct order after copying it. Similarly, you’ll provide your password and your wallet will be created.\n\n## Is Sahal Wallet Safe?\n\nThe security characteristics of the Sahal wallet make it a safe self-custody wallet. Your seed phrase, public key, and private key are all controlled by you as a self-custody wallet. It’s best not to save your seed phrase on your device because it could be lost or hacked. **_Be aware that the biggest security risk is often the user themselves._**\n\nTo receive cryptocurrencies, you can share your public key with anyone. However, because your private keys and seed phrase are what enables you access to your wallet’s funds, you must keep them secure and avoid leaking them.\n\nSahal wallet is secure enough that it **cannot be hacked directly by cyber attacks** unless you are a victim of phishing and malware attacks.\n\nThere are a few basic steps that can help **keep your crypto assets secure** in your wallet.\n\n1.  Use a secure password that is hard to guess.\n2.  Never save your seed phrase in an online drive.\n3.  Never export your private key while screen sharing with anyone.\n4.  Do not click any phishing links.\n5.  Do not connect your wallet to any suspicious websites, maybe for NFTs or airdrops.\n\nIf you are extremely careful with how you use your wallet, your wallet will be safe. \n\nBut if you are still worried about losing your crypto assets to hacks, you might want to invest in a hardware wallet — but then you had better not lose the wallet itself. \n\n**Ultimately, self custody is as secure and safe as the user but Sahal removes much of the pain and friction of ethical and halal crypto investing.**\n\n---\n\n#### MRHB DeFi Official Channels\n\n[Website](https://mrhb.network/)| [MRHB Reward Dashboard](https://rewards.mrhb.network/) | [Twitter](https://twitter.com/marhabadefi) | [Telegram Chat](https://t.me/mdf_official) | [Telegram Announcements](https://t.me/marhabadefi_ANN) | [Medium](https://medium.com/@mrhbdefi) | [Documents](https://marhabadefi.com/info-centre.php) | [Facebook](https://www.facebook.com/MRHB-DeFi-105893235209147/) | [LinkedIn](https://www.linkedin.com/company/marhabadefi/) | [Telegram Arabic Community](https://t.me/mdf_arabic) | [Russian Community](https://t.me/mdf_russia) | [Turkish Community](https://t.me/MarhabaDefiTR) |[Persian Community](https://t.me/mrhbdefi_persian) | [Urdu/Hindi Community](https://t.me/MRHBDeFi_Urdu_Hindi)","createdAt":"2022-11-15T20:44:22.635Z","updatedAt":"2022-12-09T07:05:04.414Z","publishedAt":"2022-11-15T20:44:22.630Z","locale":"en","Url":"sahal-wallet-halal-crypto","meta":"Introducing Sahal Wallet, the world's first crypto wallet to incorporate ethical and halal crypto asset screening.","cover":{"data":{"id":109,"attributes":{"name":"Sahal Wallet — The first ethical and halal crypto wallet and gateway to the MRHB Network ecosystem cover.jpg","alternativeText":null,"caption":null,"width":1440,"height":810,"formats":null,"hash":"Sahal_Wallet_The_first_ethical_and_halal_crypto_wallet_and_gateway_to_the_MRHB_Network_ecosystem_cover_009ca2a0a1","ext":".jpg","mime":"image/jpeg","size":15327.09,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/Sahal_Wallet_The_first_ethical_and_halal_crypto_wallet_and_gateway_to_the_MRHB_Network_ecosystem_cover_009ca2a0a1.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:42:03.965Z","updatedAt":"2022-12-28T12:42:03.965Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}