{"pageProps":{"articleData":{"id":2,"attributes":{"title":"TijarX: Cheap and Accessible Gold & Silver Commodity Trading","date":"2022-10-17","content":"Commodity trading is known to be complex, inefficient, and costly. However, it is still an important part of the economy as it involves everyday raw materials such as oil, grains, sugar, coffee, energy, gold and silver. These raw materials or good that can be grown or mined are known as commodities. The tokenization of such commodities has become increasingly popular and attractive with the advent of blockchain technology as it solves many current problems. \n\nTijarX commodity exchange offering tokenized assets is a wealth preservation solution to the challenges that the commodity market currently faces. \n\n---\n\n## What Is TijarX and Tokenized Assets \n\nTijarX is a newly released decentralized finance (DeFi) commodity exchange solution by [MRHB](https://mrhb.network/) (pronounced ‘Marhaba’). MRHB seeks to offer a range of DeFi solutions to build an **inclusive, ethical and interest-free web3** ecosystem. TijarX is the latest in line of MRHB's products, giving access to traditionally safe-haven assets.\n\nThe first version of **TijarX offers tokenized gold and silver**. They are ERC-20 tokens that are 100% backed by fully-allocated gold and silver bullion respectively. The precious metals are secured in a reserve vault by the Gold Silver Standard of Ainslie Bullion Group Australia.\n\n---\n\n## Current Issues With Commodity Markets \n\nMRHB created TijarX in response to the current issues that investors have been experiencing with commodity trading, such as: \n\n- Complex transactions with logistical issues. \n- Inefficient procedures involving multiple parties. \n- High operational costs due to the many procedures and intermediaries. \n- Inaccessible to the unbanked or those without means to purchase a commodity in full. \n\nThanks to blockchain technology with qualities of transparency, decentralization, and permissionless transactions, these issues can be solved. \n\n---\n\n## How TijarX Solves Commodity Trading Problems \n\nWith the above issues in mind, MRHB has released TijarX commodity exchange as an **ethical and halal DeFi solution**. This will encourage ethically concerned and faith-based communities to invest in tokenized assets such as gold and silver.  \n\nThe following are the **features of TijarX** that greatly improves the traditional commodity market as we know it. \n\n### 1. Fractional ownership \n\nBeing a decentralized commodity exchange, TijarX uses tokenized assets to facilitate trading of commodities. What’s great about tokens is that they can be broken down into smaller units. Each token on TijarX (with the smallest value of up to 4 decimal places) represents 1 gram of a commodity. As such, you can own a fraction of a commodity instead of purchasing the raw material in full.  \n\n### 2. Assets are cheaper\n\nWith no intermediaries absorbing high fees, trading commodities on TijarX is much cheaper than on traditional systems. With a more streamlined process, there is no need for operational costs. Furthermore, the commodity market with tokenized assets would create fairer prices as more people actively trade thus increasing liquidity. \n\n### 3. Borderless access\n\nTijarX does not discrimate users based on economic status or geographical location, unlike centralized exchanges. Anyone from anywhere can participate in the 24/7 permissionless commodity trading. \n\n### 4. Frictionless trading\n\nTrading commodities on TijarX is akin to buying and selling other tokens such as BTC, ETH, LTC and BNB. Due to the lack of middlemen, trading commodities have become cheaper and more straightforward.  \n\n### 5. Wealth preservation\n\nTijarX allows you access to traditionally safe-haven assets. Investing in tokenized commodities especially gold and silver can act as a hedge against inflation. The price of precious metals is known to either remain constant or increase during an economic downturn. Thus, investing in commodities may help preserve wealth. \n\n---\n\n## Start Trading Tokenized Gold & Silver on TijarX \n\n[TijarX](https://mrhb.network/ecosystem/tijarx) has made commodity trading much **simpler, cheaper and more accessible**. Investors can rest assured that the tokenized assets on TijarX have been vetted through by Islamic scholars. This is to maintain ethical standards and ensure that the assets are of **high quality**. As the platform grows, there will soon be more tokenized assets that you can own or trade.  \n\n**Start owning a piece of gold and silver on TijarX today!** The tokenized gold and silver are 100% backed by fully-allocated gold and silver bullion respectively and are redeemable. You can access TijarX via the Sahal Wallet, MRHB’s user-friendly, self-custodial, halal crypto wallet. ","createdAt":"2022-10-13T01:34:34.660Z","updatedAt":"2022-12-23T06:32:54.878Z","publishedAt":"2022-10-17T07:06:36.613Z","locale":"en","Url":"tijarx-commodity-trading","meta":"TijarX commodity exchange by MRHB DeFi offers an alternative solution for interest-free commodity trading with cheaper tokenized assets like gold and silver. ","cover":{"data":{"id":97,"attributes":{"name":"TijarX: Cheap and Accessible Gold & Silver Commodity Trading cover.jpg","alternativeText":null,"caption":null,"width":1400,"height":787,"formats":{"large":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/large_Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543.jpg","hash":"large_Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543","mime":"image/jpeg","name":"large_TijarX: Cheap and Accessible Gold & Silver Commodity Trading cover.jpg","path":null,"size":24.76,"width":1000,"height":562},"small":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/small_Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543.jpg","hash":"small_Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543","mime":"image/jpeg","name":"small_TijarX: Cheap and Accessible Gold & Silver Commodity Trading cover.jpg","path":null,"size":9.64,"width":500,"height":281},"medium":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/medium_Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543.jpg","hash":"medium_Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543","mime":"image/jpeg","name":"medium_TijarX: Cheap and Accessible Gold & Silver Commodity Trading cover.jpg","path":null,"size":16.71,"width":750,"height":422},"thumbnail":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/thumbnail_Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543.jpg","hash":"thumbnail_Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543","mime":"image/jpeg","name":"thumbnail_TijarX: Cheap and Accessible Gold & Silver Commodity Trading cover.jpg","path":null,"size":3.76,"width":245,"height":138}},"hash":"Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543","ext":".jpg","mime":"image/jpeg","size":32.61,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/Tijar_X_Cheap_and_Accessible_Gold_and_Silver_Commodity_Trading_cover_1e23185543.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:36:28.551Z","updatedAt":"2022-12-28T12:36:28.551Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}