{"pageProps":{"articleData":{"id":16,"attributes":{"title":"Tokenized Commodities: Linking Real-world Products to The Blockchain","date":"2022-10-18","content":"Cryptocurrencies have altered the financial and IT industry in inconceivable ways. In the process, blockchain technology’s core principles of security and transparency have enabled the tokenization of real-world commodities.\n\nFor years, precious metals and land have been used as a hedge against inflation and a globally accepted form of secure investment. The effective digitization of assets such as oil, gold, and silver would mean that these **commodities will become more accessible** while reducing costs of infrastructure and human resources. Thus, commodity tokenization can be extremely advantageous to the crypto sector and the general populace.\n\n## What Is Asset Tokenization?\n\nAt its fundamentals, tokenization is the **digitization of tradeable assets in the real world** that are stored using blockchain technology. The process of then moving around and trading these commodities becomes **easy and much more secure**.\n\nIn the financial sector, several types of contracts such as loans and mortgages are offered to investors as securities. The digital counterpart of this process can be referred to as **tokenization**.\n\nThe value of the tokens derives from the fact that they represent real-world commodity. A good crypto-world example would be the model of a stablecoin: the value of stablecoins is pegged to the value of fiat currencies.\n\nBlockchain allows the tokenization of commodities that can be digitized and assigned a cryptocurrency value. These commodity-backed tokens can then be traded on commodity exchanges like [TijarX](https://mrhb.network/ecosystem/tijarx), a halal trading platform for tokenized commodities built by [MRHB DeFi](https://www.mrhb.network/).\n\n## Benefits of Commodity Tokenization\n\nAlthough a relatively new concept, tokenization has already been implemented globally in the form of Non-Fungible Tokens (NFTs). The tokenized asset market has been growing steadily since the advent of NFTs and is projected to reach [$7766 million](https://www.verifiedmarketresearch.com/product/global-tokenization-market-size-and-forecast-to-2025/) by 2028.\n\nLet’s take a look at some of the benefits of tokenizing commodities.\n\n1.  **Liquidity:** Tokenization enables the trade of previously illiquid assets and broadens access to these commodities. Along with increasing the efficacy of the market, more people will actively trade, allowing investors and sellers a fairer price discovery. Additionally, blockchain operations eradicate the traditional confinements of geographical boundaries and paper transfers of ownership. Thus, tokenization enables access to these assets by a bigger audience and creates a halal and efficient financial system.\n\n2.  **Transparency**: Traditional commodity markets have a history of manipulation and deceit, which is why the amount of transparency blockchain technology enables is a highly attractive feature for investors. Blockchains are also immutable by nature, and transactions once performed cannot be altered. An attempt to do so would leave an easily detectable trace. This enables greater trust in the origin and procurement of the real-world assets tied to the tokens and allows prospective buyers to view the entire history and chain of ownership of the commodity.\n\n3.  **Decentralized Applications (DApps) and Smart Contracts:** These are a revolutionary element of commodity tokenization. Smart contracts are essentially formal agreements between two or more parties that have been programmed on the blockchain. It appears as a decentralized software (or a programming language like [Solidity](https://academy.aax.com/en/ethereum-upgrades-overview-what-is-serenity-eth-2-0/)) that executes by itself. This substitutes banks as a mediator guaranteeing payment during an exchange once the assets have been delivered. Smart contracts are very reliable and cannot be eradicated without the consent of every party involved.\n\n4.  **Accessibility:** Businesses would have a broader access to global capital. A majority of the companies dealing in natural resources currently are only able to raise funding from massive institutional banks and investors, as existing technology cannot conveniently accommodate small investors. This results in a large number of under-developed countries being unable to access the market as their banking systems cannot match ones of countries better off than them. Thus, many potential business opportunities pertaining to this sector cannot be executed not due to a lack of thought, but merely insufficient capital or resources. Tokenization can help this problem as commodity exchanges are not limited to national borders and investment processes are made convenient for the global populace.\n\n5.  **Convenience:** Traditional commodity markets are generally fraught with inefficiencies and middlemen permeate the industry completely, ready to obtain a fee for every small step of the process of trading commodities. Tokenization streamlines the entire process as all tokenized assets are directly traded on crypto exchange platforms and marketplaces. Real-world commodities like gold can be bought the same way Ethereum and Bitcoin are being bought and sold. Cryptocurrency markets also offer the advantage of 24/7 trading unlike traditional markets.\n\n## Risks of Tokenization\n\nThere are still challenges around the safe development of tokenization.\n\nThe borderless nature of digital assets has put asset tokenization on the radar of governments and regulatory authorities across the globe. There is **uncertainty around the code of conduct** and there is **no legal framework** that guides the processes. Operational risks can also arise and a certain regulatory system in this regard can go a long way in enabling the mass adoption of a token economy.\n\n##Types of Tokenized Commodities\n\nAssets when being considered for tokenization can be classified into three types: intangible, fungible, and non-fungible assets.\n\n### Intangible assets\n\nNon-monetary assets lacking physical substance that exist purely due to operational law. Some examples are copyrights, patents, shares of companies, etc.\n\n### Fungible assets\n\nAssets that can be interchanged with other commodities of equal value. The most common example is a fiat currency or a fiat currency-backed token such as a stablecoin. Commodities such as gold, silver, and other precious stones are also usually considered fungible.\n\n###Non-fungible assets\n\nUnique assets that are not necessarily interchangeable like real estate, art pieces, and digital collectibles. Despite this, non-fungible assets can also be tokenized where the token reflects the exact pricing of said commodity.\n\n## Examples of Commodity-backed Tokens\n\nSeveral commodity-backed stablecoins have cropped up in recent times. Commodity-backed cryptocurrencies range from tokens pegged to steady assets such as gold to food products. Here are a few examples:\n\n1.  **Bananacoin:** An environmentally friendly plantation in Laos released an Ethereum token pegged to the export price of 1 kg of bananas.\n2.  **PowerLedger:** A cryptocurrency backed solely by renewing energy from the sun. As solar-powered technology continues to gain momentum and becomes more lucrative, crypto commodities can be used to power remote places with access to electricity.\n3.  **El Petro:** The Venezuelan government issued crypto coins pegged to their oil reserves amidst their plummeting economy.\n4.  **The Gold & Silver Standard:** These are ERC-20 Tokens created by an Australian-based regulated bullion provider, where each AUS and AGS Token represents 1g of either gold or silver.\n\n## Trade Tokenized Commodities Ethically\n\nThere is an increased need and desire for a safe and ethical ecosystem of tokenized products. This is where MRHB’s new commodity exchange, [TijarX](https://mrhb.network/ecosystem/tijarx) comes in.\n\nOn TijarX, you will have access to a range of ethical and halal tokenized assets on one trusted platform. The first version of TijarX allows you to trade tokenized Gold and Silver. These tokenized assets are 100% backed by fully allocated gold and silver bullion respectively, secured by the Gold Silver Standard of Ainslie Bullion Group Australia.\n\nTo get started, [download Sahal Wallet](https://mrhb.network/ecosystem/sahal-wallet) to access the TijarX platform.","createdAt":"2022-11-15T20:24:52.175Z","updatedAt":"2022-12-12T06:50:08.456Z","publishedAt":"2022-11-15T20:24:52.166Z","locale":"en","Url":"tokenized-commodities-blockchain","meta":"Discover the benefits of the tokenization of commodities, the various types of tokenized commodity, and the ethical way of exchanging commodities.","cover":{"data":{"id":96,"attributes":{"name":"Tokenized Commodities: Linking Real-world Products to The Blockchain cover.jpg","alternativeText":null,"caption":null,"width":1400,"height":787,"formats":{"large":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/large_Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617.jpg","hash":"large_Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617","mime":"image/jpeg","name":"large_Tokenized Commodities: Linking Real-world Products to The Blockchain cover.jpg","path":null,"size":33.05,"width":1000,"height":562},"small":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/small_Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617.jpg","hash":"small_Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617","mime":"image/jpeg","name":"small_Tokenized Commodities: Linking Real-world Products to The Blockchain cover.jpg","path":null,"size":13.83,"width":500,"height":281},"medium":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/medium_Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617.jpg","hash":"medium_Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617","mime":"image/jpeg","name":"medium_Tokenized Commodities: Linking Real-world Products to The Blockchain cover.jpg","path":null,"size":23.18,"width":750,"height":422},"thumbnail":{"ext":".jpg","url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/thumbnail_Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617.jpg","hash":"thumbnail_Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617","mime":"image/jpeg","name":"thumbnail_Tokenized Commodities: Linking Real-world Products to The Blockchain cover.jpg","path":null,"size":5.43,"width":245,"height":138}},"hash":"Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617","ext":".jpg","mime":"image/jpeg","size":41.1,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/Tokenized_Commodities_Linking_Real_world_Products_to_The_Blockchain_cover_1a6a4ef617.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:34:10.435Z","updatedAt":"2022-12-28T12:34:10.435Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}