{"pageProps":{"articleData":{"id":33,"attributes":{"title":"Universal Basic Income in an Ethical World of Finance","date":"2022-03-04","content":"In looking at the role of ethics in finance, today we will explore the concept of Universal Basic Income and in particular how the GoodDollar project has been established.\n\nUBI or Universal Basic income, is a concept that has been around since the 1800s but which has gained more popularity in recent years. 2020 Democratic hopeful presidential candidate Andrew Yang made it a part of his political campaign, many Nordic states are actively discussing the idea and increasingly it is seen as part of a raft of solutions aiming at reducing and eliminating widespread income inequality.\n\nHaving access to UBI meets most resistance with two main arguments. The first is that people will cease to work if they have a basic income. The second is that the UBI will be funded out of national tax, i.e. out of people’s wallets. Both arguments can be emotive and divisive.\n\nOf course, the UBI proposed so far has not been of the _get rich_ variety and unlikely to temp the majority of people to cease employment. It is more likely to assist people needing financial support to care for loved ones or pursue passion projects with low financial return. Conversely, there has been a dearth of ideas on how to fund UBI painlessly, or at least without impacting people in their own pockets, a situation most likely to generate blowback from society.\n\nGoodDollar, from eToro, comes to the table with a plan to manage both arguments, essentially kicking them both into touch. For starters, it considers UBI should be available to anyone regardless of age, sex, race, employment status and creed — removing the potential _them and us_ scenario. GoodDollar’s appearance is timely as during the lockdowns, UBIs have been essentially implemented in part, in many parts of the world (through helicopter money to citizens) and some 20 counties are now actively evaluating this as a policy decision.\n\nIn addition, GoodDollar has looked at implementing UBI outside of government and related tax systems.\n\nGoodDollar is the brainchild of eToro founder Yoni Assia. eToro shares similar social aspirations as its brainchild, with both looking to democratise access to finance and lowering the barriers to the formal financial system, namely to capital markets — although initial claimers from GoodDollar are not expected to be able to benefit from capital markets immediately.\n\nSetting up GoodDollar, Yoni and eToro invested $3million to ensure the startup was well funded and did not need to rely on donations to begin its work. Anna Stone takes up the story:\n\n“We are all familiar with the size of the unbanked population, some 1.7 billion people, but we are not looking to bank those people, rather to give them access to money. We need to educate them on how to manage their money, which is the first step to building wealth.\n\n“There is a journey where people learn about financial assets through an introduction to digital money, and how to manage them.”\n\nSince the launch in September 2020, some 61,000 people have signed up with 20,000 active visitors to the site every day.\n\n“The GoodDollar protocol is a free money flow that anyone can tap into. However, it is really important to understand this is a market incentivised economic model that allows the system to pay for itself.”\n\nLet’s return to that epic phase ‘pay for itself’ after we investigate the process.\n\nUsers, as in people who wish to claim GoodDollars, sign up for a wallet at wallet.gooddollar.org. This creates a blockchain wallet and when the user signs it, they receive a quantity of GoodDollars every day. This daily distribution of a digital basic income is in fact a digital asset.\n\nHow is this digital asset created, is it sustainable and it is scalable?\n\n“The GoodDollar is an inspired example of impact investment allowed by Blockchain.”\n\nGoodDollar uses the example of endowment vehicles when a wealthy benefactor deposits money in favour of an institution which receives the interest from the deposit. This method is very popular for funding non profits or educational institutions. In the world of cryptocurrency, the concept of deposit or endowment is replaced by the word staking in the decentralised finance blockchain world where money, in this case cryptocurrency assets, is locked away to produce a yield.\n\nThe resulting interest is used to fund the UBI with a portion returning to the investor in the form of GoodDollar coins.\n\n“In this way, we have built a symbiotic sustainable Basic Income system.”\n\nProofs are in the pudding and already eToro can point to the $56,000 it personally sponsored returning $5000 in GoodDollar.\n\n“Proof of concept delivered there and then. Moreover, philanthropic donors enjoy full draw down abilities so their funds are not locked away permanently. While we have first implemented the POC on Ethereum, this vision can be implemented at scale to any protocol and any yield mechanism.”\n\nScaling this model to the world will pose natural problems but right now GoodDollar is focused on growing to the first tier of supporting millions of users.\n\n“We are coming from a current world view where there is not enough capital to give every human being access to basic economic assets. We want to change that mindset and use market incentives to tap into the view there is enough and we can do better for ourselves and for others. When we change the world view we can change the narrative.”\n\nAs a startup, GoodDollar has not as yet determined what success will look like or how much each daily amount might be. Instead Anna turns the question on its head and suggests instead we look at how GoodDollar can enable its users and community, and how it can enable change.\n\n“One of the most exciting things is seeing users create a global community where they can collaborate and do more economic activity than they could before.”\n\nTraditional consumption revolves around using GoodDollar to buy food. There has been an increase in neighbourhood activities with community members setting up their own marketplaces and conducting peer to peer transactions using GoodDollar. This has extended to community members using Good Dollars to buy old bikes and for agricultural initiatives for food products.\n\n“Entrepreneurial endeavours are also on the rise — helped by people who want to see their dollars do good. Now entrepreneurs are using GoodDollars to grow their business. For example, there is a graphic designer in Cuba who accepts GoodDollars for first projects — using it as a lead generation tool. Another example is an entrepreneur who created a gift card business for local restaurants and shops. Yet another example is a community member who has been collecting GoodDollars on behalf of a soup kitchen who found his funds matched by an angel investor in fiat currency. So, he not only tapped into the global GoodDollar community to raise funds in GoodDollars, but also found it matched in fiat funds by a GoodDollar angel philanthropist.”\n\nCurrently the GoodDollar is not listed on any exchanges but it is an ERC 20 token and interoperable with other Ethereum based tokens. The cash out feature is not supported through the wallet or platform but the aim is to make a ramp to other cryptocurrencies.\n\n“We are new and it takes time to build an ecosystem — but our aim is to make GoodDollar liquid and available across as many countries as possible.”\n\nAnyone wanting to get involved — either as claimer or supporter — should head over to GoodDollar.org. To claim Gooddollars, go to wallet.gooddollar.org and set up a wallet — from there you just need to login every day to claim your GoodDollars.","createdAt":"2022-11-15T20:48:07.652Z","updatedAt":"2023-01-03T07:53:51.558Z","publishedAt":"2022-11-15T20:48:07.645Z","locale":"en","Url":"ubi-in-an-ethical-world-of-finance","meta":"In looking at the role of ethics in finance, today we will explore the concept of Universal Basic Income (UBI) and in particular how the GoodDollar project has been established.","cover":{"data":{"id":115,"attributes":{"name":"UBI in an Ethical World of Finance cover.jpg","alternativeText":null,"caption":null,"width":1440,"height":810,"formats":null,"hash":"UBI_in_an_Ethical_World_of_Finance_cover_27f3754371","ext":".jpg","mime":"image/jpeg","size":4576,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/UBI_in_an_Ethical_World_of_Finance_cover_27f3754371.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:42:53.454Z","updatedAt":"2022-12-28T12:42:53.454Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}