{"pageProps":{"articleData":{"id":30,"attributes":{"title":"What’s the Real Reason for the Recent Bitcoin Price Spikes (Amid War)?","date":"2022-03-28","content":"The Russian stock market has been consistently plummeting during the Ukraine invasion, slumping as much as 45% on the first day of invasion, marking it the 5th worst plunge in equity market history. MSCI and other major index providers also [unplugged Russian stocks from global benchmarks](https://www.wsj.com/livecoverage/russia-ukraine-latest-news-2022-03-09/card/russia-disappears-from-major-indexes-this-week-1FzO3x7CDKFFeiiazQql), leading to a complete shutdown of the Russian stock market until a couple of days ago.\n\nThe surge can be explained in part by Russians flocking to escape the ruble, after it was announced that Russia would be thrown out of the SWIFT interbank service and its central bank would have its assets seized.\n\nFor the first time since the advent of Bitcoin, the cryptocurrency pulled ahead of Russia’s ruble, leading to many investors bailing out on Russian assets in the face of pressurising financial sanctions.\n\nSeveral discussions have been initiated to discuss the role of cryptocurrencies during the crisis, [some centering around its impact on Bitcoin](https://m.youtube.com/watch?v=n3lOqXM9b28&t=505s), and others on whether or not Russia can evade sanctions using crypto. While this is a viable option, it might not end well for the Russian government as it would mean giving up significant control over their own monetary system and giving economic power to their people. Besides, there are precautionary measures taken by crypto regulatory bodies to ensure that Russia would for the most part not be able to evade sanctions using only Bitcoin.\n\nAs a majority of the populace is losing faith in their fiat currency, it has inevitably created a big pocket of demand for Bitcoin. But can the higher demand be the sole reason for the sudden surge in BTC prices?\n\n## Can the Bitcoin Price Spike Be Induced By Higher Demand?\n\nSince Russia invaded Ukraine, crypto prices rose by 20% and the Ruble [dropped by nearly 25%](https://www.google.com/amp/s/www.benzinga.com/amp/content/26032937), the parallel timing leading to the assumption that the Bitcoin spike was solely due to the crisis.\n\nUpon closer inspection, could the $4000 spike be caused by Russia?\n\nAccording to [InvestAnswers](https://www.youtube.com/channel/UClgJyzwGs-GyaNxUHcLZrkg), the amount of money required to naturally create this spike sums up to a total of $3.8 billion. Though there was a significant spike in the trade volume of the ruble since the invasion, the total added to just $254 million. This is while accounting for the flow of the ruble currency as well as the Euros, which Russian oligarchs presiding in Europe would have used to fund Bitcoin. So considering every possible aspect in the recent outflow of money, this is not enough to be the cause of the big Bitcoin spike.\n\n## The Crisis Acted as a Catalyst for The Rise in BTC prices\n\nFirstly, the BTC market has had a 9% spike since the invasion and has slowly been going back into a [risk-on market](https://www.investopedia.com/terms/r/risk-on-risk-off.asp), after risk-on assets have been clobbered in past weeks, and global economic situations have led to market changes. As major investors feel like the Bitcoin market is being supported by strong influential fundamentals, they have engaged in larger and more profitable trades.\n\nIf we take a look at current perpetual funding rates, it will show that there has been a massive negative funding rate since the start of the invasion, which created a short squeeze. This short squeeze resulted in a rapid rise in cryptocurrency prices and acted as a green light for investors, as it indicated positive buying signals for long sellers.\n\nThis led to several major hedge fund companies pouring millions of dollars into cryptocurrency. Long-term investors have swooped in to buy more bitcoin at its lowest prices, leading to big losses for short-term Bitcoin holders.\n\nThe reason for the short squeeze can clearly be accounted for by the 254 million dollars outflow from Russia and Ukraine. So while it could not have single-handedly created a $4000 spike, the crisis acted as a catalyst for the rise in BTC prices. A domino effect ensued, paving the way for the other factors mentioned above that completely transformed the BTC market since the Russia-Ukraine crisis.","createdAt":"2022-11-15T20:47:44.280Z","updatedAt":"2023-01-03T04:28:02.271Z","publishedAt":"2022-11-15T20:47:44.275Z","locale":"en","Url":"whats-the-real-reason-for-the-recent-bitcoin-price-spikes-amid-war","meta":"The Russian stock market has been consistently plummeting during the Ukraine invasion yet Bitcoin price continues to hike. What's the reason?","cover":{"data":{"id":112,"attributes":{"name":"What’s the Real Reason for the Recent Bitcoin Price Spikes (Amid War)? cover.jpg","alternativeText":null,"caption":null,"width":1440,"height":810,"formats":null,"hash":"What_s_the_Real_Reason_for_the_Recent_Bitcoin_Price_Spikes_Amid_War_cover_9dd74d7896","ext":".jpg","mime":"image/jpeg","size":2097.28,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/What_s_the_Real_Reason_for_the_Recent_Bitcoin_Price_Spikes_Amid_War_cover_9dd74d7896.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:42:26.034Z","updatedAt":"2022-12-28T12:42:26.034Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}