{"pageProps":{"articleData":{"id":32,"attributes":{"title":"When Governments Turned to Crypto: How Digital Currencies Save Lives in a War","date":"2022-03-15","content":"As the Russia-Ukraine war rages on, the role of digital assets in the conflict becomes impossible to ignore. Amid the rising tensions and collapsing monetary markets, crypto has emerged to be a powerful financial weapon on both sides of the war.\n\n## Crypto in Russia and Ukraine\n\nIt started with a parliamentary bill. A few weeks prior to the Russian invasion, Ukraine’s Parliament passed a law stating the legalization of cryptocurrencies and exchanges. Shortly after this, Russia’s Finance Ministry announced that they would consider working on the legislation of digital assets in Russia.\n\nSince then, crypto trading in Russia has picked up. The trading volume continued to increase as economic sanctions started to batter the economy, and the value of the ruble dropped further. Before you knew it, the currency hit [a record low of almost 118 against the USD](https://www.ft.com/content/f7148532-36cd-4683-8f1b-ea79428488c4) and citizens frantically turned to digital currencies in an attempt to protect their assets in a crumbling economy.\n\nOver in Ukraine, both citizens and the government also turned to cryptocurrencies, accepting donations in crypto to support the war efforts. A mass crowdfunding appeal on Twitter led to millions of people responding from all over the world. A blockchain analysis conducted by Elliptic revealed that more than [US$50 million in virtual currency](https://www.cnbc.com/2022/03/03/ukraine-raises-54-million-as-bitcoin-donations-surge-amid-russian-war.html) was donated to Ukraine’s organizations since the start of the Ukraine invasion. While this amount pales in comparison to the much larger funds at Russia’s disposal, the rapid accumulation of financial support provides a compelling case for crypto’s role as a non-violent intervention in war and crisis.\n\nNon-fungible tokens (NFTs) were also used as alternatives to the Ukraine government’s Ethereum account. **All these donations flowed in effortlessly without middlemen and currency conversion impediments.** **The ease of using digital currencies was obvious in the fundraise for Ukraine, faster than the traditional methods of donations that would otherwise take weeks to be utilizable.**\n\n## Will Russia find a way to evade economic sanctions with crypto?\n\nWhile decreasing ruble value has led more people in Russia to turn to cryptocurrencies, can Russia use the cryptocurrency ecosystem to find a way around the economic sanctions?\n\nIt is unlikely. While exploitation from bad actors in Russia remains a concern, measures are being put in place to prevent such evasion. There are ways to trace the origin of transactions and such identification from sanctioned entities can make evasion fairly difficult. At best, only limited quantities of crypto transactions can get through, and that too, via unregulated exchanges.\n\n## Current and future socio-economic impact of cryptocurrencies\n\nUnfortunately, the cryptocurrency market itself did not fare too well at the start of the war. The more popular currencies such as [Bitcoin and Ethereum depreciated drastically](https://www.google.com/amp/s/time.com/nextadvisor/investing/cryptocurrency/ethereum-hits-new-all-time-high-price/amp/) on the first day, primarily due to Russia being its third-largest country of crypto consumers. After the economic sanctions were placed on Russia however, the daily trading volume of Rubles to Bitcoin surged to almost 200%. On the Ukrainian side, the trading volume tripled, making both countries a large part of the digital asset’s user base. The fact that Bitcoin can potentially act as an alternative inflation hedge is an important factor accounting for the rising number of crypto exchanges in Russia.\n\nAlthough the crypto market’s recent fluctuations are not solely caused by the war, Bitcoin is proving to be a more stable investment than the Russian ruble.\n\nIn the grand scheme of things, cryptocurrencies played a relatively small role in the war. But it does elevate the wider discussion on the part cryptocurrencies currently play in our society and the potential significance they can have in the future.\n\nThis is the first geopolitical crisis that cryptocurrencies have been a part of but it’s very likely it won’t be the last.","createdAt":"2022-11-15T20:47:59.524Z","updatedAt":"2023-01-03T04:35:53.250Z","publishedAt":"2022-11-15T20:47:59.514Z","locale":"en","Url":"when-governments-turned-to-crypto-how-digital-currencies-save-lives","meta":"Amid the rising tensions in Russia and Ukraine, crypto has emerged to be a powerful financial weapon on both sides of the war.","cover":{"data":{"id":114,"attributes":{"name":"When Governments Turned to Crypto: How Digital Currencies are Saving Lives in a War cover.jpg","alternativeText":null,"caption":null,"width":1440,"height":810,"formats":null,"hash":"When_Governments_Turned_to_Crypto_How_Digital_Currencies_are_Saving_Lives_in_a_War_cover_882222235a","ext":".jpg","mime":"image/jpeg","size":1316.96,"url":"https://mrhb-strapi-bucket.s3.eu-west-2.amazonaws.com/When_Governments_Turned_to_Crypto_How_Digital_Currencies_are_Saving_Lives_in_a_War_cover_882222235a.jpg","previewUrl":null,"provider":"aws-s3","provider_metadata":null,"createdAt":"2022-12-28T12:42:42.854Z","updatedAt":"2022-12-28T12:42:42.854Z"}}},"authors":{"data":[]}}}},"__N_SSG":true}